[
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:Ernest Hemingway wdt:manner of death ?var0.}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:manner of death wd:Ernest Hemingway.}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:House of Medici wdt:owner of\/wdt:industry ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:owner of\/wdt:industry wd:House of Medici}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT ?var0 WHERE {wd:United States wdt:official name ?var0 FILTER(langMatches(lang(?var0),\"tr\"))}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT ?var0 WHERE {?var0 wdt:official name wd:United States FILTER(langMatches(lang(?var0),\"tr\"))}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT ?var0 WHERE {wd:Cologne Cathedral wdt:height ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT ?var0 WHERE {?var0 wdt:height wd:Cologne Cathedral}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:Harz rdfs:label ?var0 FILTER(langMatches(lang(?var0),\"zh-cn\")) }",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 rdfs:label wd:Harz FILTER(langMatches(lang(?var0),\"zh-cn\")) }"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:instance of wd:international airport. ?var0 wdt:located in the administrative territorial entity* wd:Hamburg}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:instance of wd:international airport. wd:Hamburg wdt:located in the administrative territorial entity* ?var0}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:instance of wd:album. ?var0 wdt:performer wd:Madonna. }",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:instance of wd:album. wd:Madonna. wdt:performer ?var0 }"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:instance of wd:album. ?var0 wdt:performer wd:Mariah Carey. }",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {wd:album. wdt:instance of ?var0 ?var0 wdt:performer wd:Mariah Carey. }"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:form of creative work wd:studio album. ?var0 wdt:performer wd:Lana Del Rey. }",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:form of creative work wd:studio album. wd:Lana Del Rey. wdt:performer ?var0 }"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:instance of wd:ancient civilization}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {wd:ancient civilization wdt:instance of ?var0}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {wd:Kobe Bryant p:P166 ?var2. ?var2 ps:P166 wd:NBA All-Defensive Team; pq:P585 ?var0.}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {?var2 p:P166 wd:Kobe Bryant. ?var2 ps:P166 wd:NBA All-Defensive Team; pq:P585 ?var0.}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {wd:Kobe Bryant p:P166 ?var2. ?var2 ps:P166 wd:All-NBA Team; pq:P585 ?var0. wd:Shaquille O'Neal p:P166 ?var22. ?var22 ps:P166 wd:All-NBA Team; pq:P585 ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {wd:Kobe Bryant ?var22 ?var2. ?var2 ps:P166 wd:All-NBA Team; pq:P585 ?var0. wd:Shaquille O'Neal p:P166 p:P166. ?var22 ps:P166 wd:All-NBA Team; pq:P585 ?var0}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:author wd:Stephen King; wdt:instance of wd:literary work}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {wd:Stephen King; wdt:author ?var0 wdt:instance of wd:literary work}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {wd:Sarah J. Maas wdt:notable work ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:notable work wd:Sarah J. Maas}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {wd:Jeff Bezos p:P26 ?var2. ?var2 ps:P26 ?var3. ?var0 wdt:mother ?var3; wdt:father wd:Jeff Bezos. FILTER(EXISTS{?var2 pq:P582 ?var4})}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {wd:Jeff Bezos p:P26 ?var2. ?var3 ps:P26 ?var2. ?var0 wdt:mother ?var3; wdt:father wd:Jeff Bezos. FILTER(EXISTS{?var2 pq:P582 ?var4})}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {wd:Paul McCartney p:P26 ?var2. ?var2 ps:P26 ?var3. ?var0 wdt:mother ?var3; wdt:father wd:Paul McCartney. FILTER((EXISTS{?var2 pq:P582 ?var4}) && (?var3 = wd:Linda McCartney))}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {wd:Paul McCartney p:P26 ?var2. ?var3 ps:P26 ?var2. ?var0 wdt:mother ?var3; wdt:father wd:Paul McCartney. FILTER((EXISTS{?var2 pq:P582 ?var4}) && (?var3 = wd:Linda McCartney))}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:instance of wd:animal from the Chinese zodiac}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {wd:animal from the Chinese zodiac wdt:instance of ?var0}"
  }
]