[
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:net worth ?var1; wdt:occupation wd:entrepreneur} ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var1 wdt:net worth ?var0; wdt:occupation wd:entrepreneur} ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:Queer Eye wdt:cast member ?var0. ?var0 wdt:date of birth ?var1} ORDER BY ASC(?var1) LIMIT 1",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:cast member wd:Queer Eye. ?var0 wdt:date of birth ?var1} ORDER BY ASC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:Smite wdt:publisher ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:publisher wd:Smite}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE { wd:Nanga Parbat wdt:country ?var0. }",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:country wd:Nanga Parbat. }"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:Star Wars: Episode VI – Return of the Jedi wdt:producer ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:producer wd:Star Wars: Episode VI – Return of the Jedi}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {{SELECT (COUNT (DISTINCT ?var1) AS ?var2) WHERE {?var1 wdt:cast member wd:Daniel Day-Lewis; wdt:instance of wd:film}} {SELECT (COUNT (DISTINCT ?var1) AS ?var3) WHERE {?var1 wdt:cast member wd:Paul Dano; wdt:instance of wd:film}} BIND(IF((?var2 > ?var3), wd:Daniel Day-Lewis, wd:Paul Dano) AS ?var0)}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {{SELECT (COUNT (DISTINCT ?var1) AS ?var2) WHERE {wd:Paul Dano; wdt:cast member wd:Daniel Day-Lewis; wdt:instance of wd:film}} {SELECT (COUNT (DISTINCT ?var1) AS ?var3) WHERE {?var1 wdt:cast member ?var1 wdt:instance of wd:film}} BIND(IF((?var2 > ?var3), wd:Daniel Day-Lewis, wd:Paul Dano) AS ?var0)}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:Simone de Beauvoir wdt:nominated for ?var0. ?var0 wdt:instance of wd:literary award}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:nominated for wd:Simone de Beauvoir. ?var0 wdt:instance of wd:literary award}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:NPR Tiny Desk Concerts wdt:official website ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:official website wd:NPR Tiny Desk Concerts}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:Boo-Boo Bear wdt:creator ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:creator wd:Boo-Boo Bear}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:Unbreakable Kimmy Schmidt wdt:creator ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:creator wd:Unbreakable Kimmy Schmidt}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:Llamas with Hats wdt:director ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:director wd:Llamas with Hats}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:Roland Corporation wdt:founded by ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:founded by wd:Roland Corporation}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:Pinhead wdt:performer ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:performer wd:Pinhead}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {{wd:Socrates wdt:mother ?var0} UNION {wd:Socrates wdt:father ?var0}}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {{?var0 wdt:mother wd:Socrates} UNION {wd:Socrates wdt:father ?var0}}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:Anne of Green Gables wdt:author ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:author wd:Anne of Green Gables}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:Howl wdt:author ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:author wd:Howl}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:The Hellbound Heart wdt:author ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:author wd:The Hellbound Heart}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {wd:Clara Westhoff wdt:spouse ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:spouse wd:Clara Westhoff}"
  }
]