[
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT (DISTINCT ?var0) AS ?var1) WHERE {wd:Chulalongkorn wdt:spouse ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT (DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:spouse wd:Chulalongkorn}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT (DISTINCT ?var0) AS ?var1) WHERE {wd:Giorgio Moroder p:P166 ?var0. ?var0 ps:P166\/wdt:instance of wd:Golden Globe Awards}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT (DISTINCT ?var0) AS ?var1) WHERE {?var0 p:P166 wd:Giorgio Moroder. ?var0 ps:P166\/wdt:instance of wd:Golden Globe Awards}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT (DISTINCT ?var0) AS ?var1) WHERE {wd:Kobe Bryant wdt:participant in ?var0. ?var0 wdt:instance of\/wdt:subclass of wd:Olympic Games}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT (DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:participant in wd:Kobe Bryant. ?var0 wdt:instance of\/wdt:subclass of wd:Olympic Games}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT (DISTINCT ?var0) AS ?var1) WHERE {wd:None p:P39 ?var0. ?var0 ps:P39 wd:member of the Landtag of Saarland}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT (DISTINCT ?var0) AS ?var1) WHERE {?var0 p:P39 wd:None. ?var0 ps:P39 wd:member of the Landtag of Saarland}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT (DISTINCT ?var0) AS ?var1) WHERE {wd:Empire of Japan wdt:participant in ?var0. ?var0 wdt:instance of wd:war}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT (DISTINCT ?var0) AS ?var1) WHERE {wd:Empire of Japan wdt:participant in ?var0. wd:war wdt:instance of ?var0}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT (DISTINCT ?var0) AS ?var1) WHERE {wd:Die Brücke wdt:founded by ?var0. ?var0 wdt:sex or gender wd:female}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT (DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:founded by wd:Die Brücke. ?var0 wdt:sex or gender wd:female}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var0 wdt:longest observed lifespan ?var1. FILTER(?var0 IN (wd:common bottlenose dolphin, wd:Ursus arctos))} ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT DISTINCT ?var0 WHERE {?var1 wdt:longest observed lifespan ?var0. FILTER(?var0 IN (wd:common bottlenose dolphin, wd:Ursus arctos))} ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT ?var0 WHERE {wd:TNFAIP1 wdt:instance of ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT ?var0 WHERE {?var0 wdt:instance of wd:TNFAIP1}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(?var0) AS ?var1) WHERE {wd:Naomi Novik p:P166\/ps:P166 ?var0 FILTER(?var0 = wd:Nebula Award)}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(?var0) AS ?var1) WHERE {?var0 p:P166\/ps:P166 wd:Naomi Novik FILTER(?var0 = wd:Nebula Award)}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT (DISTINCT ?var0) AS ?var1) WHERE {wd:Mongol invasions of Japan wdt:point in time ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT (DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:point in time wd:Mongol invasions of Japan}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(?var0) AS ?var1) WHERE {wd:Naomi Novik p:P1411\/ps:P1411 ?var0 FILTER(?var0 = wd:Hugo Award)}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(?var0) AS ?var1) WHERE {?var0 p:P1411\/ps:P1411 wd:Naomi Novik FILTER(?var0 = wd:Hugo Award)}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT ?var0 WHERE{?var1 wdt:instance of wd:dog. ?var1 wdt:date of birth ?var2; wdt:date of death ?var3 BIND((YEAR(?var3) - YEAR(?var2)) AS ?var0)} ORDER BY DESC(?var0) LIMIT 1 OFFSET 1",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT ?var0 WHERE{?var1 wdt:instance of wd:dog. ?var2 wdt:date of birth ?var1; wdt:date of death ?var3 BIND((YEAR(?var3) - YEAR(?var2)) AS ?var0)} ORDER BY DESC(?var0) LIMIT 1 OFFSET 1"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {?var0 wdt:instance of wd:film; wdt:cast member wd:Ryan Gosling, wd:Carey Mulligan}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {wd:film; wdt:instance of ?var0 wdt:cast member wd:Ryan Gosling, wd:Carey Mulligan}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT ?var0 WHERE {wd:Ghost in the Shell wdt:country of origin ?var1. ?var1 wdt:head of state ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT ?var0 WHERE {?var1 wdt:country of origin wd:Ghost in the Shell. ?var1 wdt:head of state ?var0}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {wd:Cage the Elephant wdt:location of formation\/wdt:located in the administrative territorial entity* ?var2. ?var2 wdt:instance of wd:U.S. state; wdt:located in or next to body of water ?var0. ?var0 wdt:instance of wd:river}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE {?var2 wdt:location of formation\/wdt:located in the administrative territorial entity* wd:Cage the Elephant. ?var2 wdt:instance of wd:U.S. state; wdt:located in or next to body of water ?var0. ?var0 wdt:instance of wd:river}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT ?var0 WHERE {wd:Veltins Brewery wdt:headquarters location ?var1. ?var1 wdt:located in the administrative territorial entity* ?var0. ?var0 wdt:instance of wd:federated state of Germany}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT ?var0 WHERE {?var1 wdt:headquarters location wd:Veltins Brewery. ?var1 wdt:located in the administrative territorial entity* ?var0. ?var0 wdt:instance of wd:federated state of Germany}"
  },
  {
    "output":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT ?var0 WHERE {wd:New York Yankees wdt:home venue ?var0}",
    "input":"PREFIX bd: <http:\/\/www.bigdata.com\/rdf#> PREFIX dct: <http:\/\/purl.org\/dc\/terms\/> PREFIX geo: <http:\/\/www.opengis.net\/ont\/geosparql#> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX psn: <http:\/\/www.wikidata.org\/prop\/statement\/value-normalized\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wds: <http:\/\/www.wikidata.org\/entity\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wdv: <http:\/\/www.wikidata.org\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> SELECT ?var0 WHERE {?var0 wdt:home venue wd:New York Yankees}"
  }
]