[
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> ASK WHERE { dbr:Barack_Obama dbo:spouse dbr:Michelle_Obama }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> ASK WHERE { dbr:Michelle_Obama dbo:spouse dbr:Barack_Obama }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:City . dbr:Sylvester_Stallone dbo:residence ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:City . ?var0 dbo:residence dbr:Sylvester_Stallone }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Book ; dbo:publisher dbr:Viking_Press ; dbo:author dbr:Jack_Kerouac }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbr:Viking_Press rdf:type dbo:Book ; dbo:publisher ?var0 ; dbo:author dbr:Jack_Kerouac }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Hotel_California dbo:writer ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:writer dbr:Hotel_California }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Canada dbo:capital ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:capital dbr:Canada }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Tel_Aviv dbo:leaderName ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:leaderName dbr:Tel_Aviv }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Russia dbo:governmentType ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:governmentType dbr:Russia }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Book ; dbo:author dbr:Muhammad_Ali }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbr:Muhammad_Ali rdf:type dbo:Book ; dbo:author ?var0 }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Mount_Everest dbo:firstAscentPerson ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:firstAscentPerson dbr:Mount_Everest }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 rdf:type dbo:Language . dbr:Colombia dbo:language ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 rdf:type dbo:Language . ?var0 dbo:language dbr:Colombia }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Czech_Republic dbo:currency ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:currency dbr:Czech_Republic }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:wineProduced dbr:Sparkling_wine ; dbo:location dbr:France }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Sparkling_wine dbo:wineProduced ?var0 ; dbo:location dbr:France }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Boris_Becker dbo:activeYearsEndDate ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:activeYearsEndDate dbr:Boris_Becker }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Film ; dbo:starring dbr:Mickey_Rourke ; dbo:director dbr:Guy_Ritchie }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbo:Film rdf:type ?var0 ; dbo:starring dbr:Mickey_Rourke ; dbo:director dbr:Guy_Ritchie }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Film ; dbo:starring dbr:Julia_Roberts ; dbo:starring dbr:Richard_Gere }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbo:Film rdf:type ?var0 ; dbo:starring dbr:Julia_Roberts ; dbo:starring dbr:Richard_Gere }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:author dbr:Ernest_Hemingway ; dbo:literaryGenre dbr:Autobiography }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Ernest_Hemingway dbo:author ?var0 ; dbo:literaryGenre dbr:Autobiography }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Amazon_Eve dbo:height ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:height dbr:Amazon_Eve }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:governmentType dbr:Borough_(New_York_City) }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Borough_(New_York_City dbo:governmentType ?var0) }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:RecordLabel ; dbo:genre dbr:Grunge ; dbo:country dbr:Canada }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbr:Canada rdf:type dbo:RecordLabel ; dbo:genre dbr:Grunge ; dbo:country ?var0 }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Ganges dbo:sourceCountry ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:sourceCountry dbr:Ganges }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbr:Penguin_Books dbo:founder ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:founder dbr:Penguin_Books }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Game_of_Thrones dbo:composer ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:composer dbr:Game_of_Thrones }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Eritrea dbo:leader ?var0 ; dbo:leaderTitle \"President\"@en }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { \"President\"@en dbo:leader ?var0 ; dbo:leaderTitle dbr:Eritrea }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbr:John_F._Kennedy dbo:deathPlace ?var0 . ?var0 rdf:type dbo:City }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbr:John_F._Kennedy dbo:deathPlace ?var0 . dbo:City rdf:type ?var0 }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Mountain ; dbo:locatedInArea dbr:Australia ; dbo:elevation ?var1 } ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbr:Australia rdf:type dbo:Mountain ; dbo:locatedInArea ?var0 ; dbo:elevation ?var1 } ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT ?var0 WHERE { dbr:Farmers'_Almanac dbp:editor ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT ?var0 WHERE { ?var0 dbp:editor dbr:Farmers'_Almanac }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:China dbo:currency ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:currency dbr:China }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:field dbr:Oceanography ; dbo:birthPlace dbr:Sweden }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Sweden dbo:field dbr:Oceanography ; dbo:birthPlace ?var0 }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbr:Headquarters_of_the_United_Nations dbo:location ?var0 . ?var0 rdf:type dbo:City }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:location dbr:Headquarters_of_the_United_Nations . ?var0 rdf:type dbo:City }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> ASK WHERE { dbr:Tom_Hanks dbo:spouse dbr:Rita_Wilson }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> ASK WHERE { dbr:Rita_Wilson dbo:spouse dbr:Tom_Hanks }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Country ; dbo:language dbr:Japanese_language }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbr:Japanese_language rdf:type dbo:Country ; dbo:language ?var0 }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:director dbr:Tim_Burton ; dbo:budget ?var1 } ORDER BY ?var1 OFFSET 0 LIMIT 1",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Tim_Burton dbo:director ?var0 ; dbo:budget ?var1 } ORDER BY ?var1 OFFSET 0 LIMIT 1"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Museum ; dbo:location dbr:New_York_City ; dbo:numberOfVisitors ?var1 } ORDER BY DESC(?var1) OFFSET 0 LIMIT 1",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var1 rdf:type dbo:Museum ; dbo:location dbr:New_York_City ; dbo:numberOfVisitors ?var0 } ORDER BY DESC(?var1) OFFSET 0 LIMIT 1"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Album ; dbo:artist dbr:Queen_(band) ; dbo:releaseDate ?var1 } ORDER BY ASC(?var1) OFFSET 0 LIMIT 1",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbo:Album rdf:type ?var0 ; dbo:artist dbr:Queen_(band) ; dbo:releaseDate ?var1 } ORDER BY ASC(?var1) OFFSET 0 LIMIT 1"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Queens_of_the_Stone_Age dbo:alias ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:alias dbr:Queens_of_the_Stone_Age }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Film ; dbo:starring dbr:Alec_Guinness ; dbo:releaseDate ?var1 } ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var1 rdf:type dbo:Film ; dbo:starring dbr:Alec_Guinness ; dbo:releaseDate ?var0 } ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Last_Action_Hero dbo:starring ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:starring dbr:Last_Action_Hero }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT ?var0 WHERE { dbr:Pluto dbo:discoverer ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT ?var0 WHERE { ?var0 dbo:discoverer dbr:Pluto }"
  }
]