[
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:type dbr:Nonprofit_organization { ?var0 dbo:type dbr:Nonprofit_organization } UNION { ?var0 dbo:type ?var1 . ?var1 dbo:type dbr:Nonprofit_organization } }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:type dbr:Nonprofit_organization { ?var0 dbo:type dbr:Nonprofit_organization } UNION { ?var1 dbo:type ?var0 . ?var1 dbo:type dbr:Nonprofit_organization } }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Pope_John_Paul_II dbp:successor ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:successor dbr:Pope_John_Paul_II }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Astronaut ; dbp:type dbr:European_Space_Agency }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbo:Astronaut a ?var0 ; dbp:type dbr:European_Space_Agency }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:title dbr:President_of_Pakistan ; dbp:title 1978 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:President_of_Pakistan dbp:title ?var0 ; dbp:title 1978 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Rolls-Royce_Motors dbo:owner ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:owner dbr:Rolls-Royce_Motors }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Museum ; dbo:Museum dbr:Paris }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:Museum a ?var0 ; dbo:Museum dbr:Paris }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:John_F._Kennedy dbo:deathPlace ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:deathPlace dbr:John_F._Kennedy }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Person { ?var0 dbo:Person \"Chancellor of Germany\" } UNION { ?var0 dbp:office dbr:Chancellor_of_Germany } }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Person { dbr:Chancellor_of_Germany dbo:Person \"Chancellor of Germany\" } UNION { ?var0 dbp:office ?var0 } }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Person { ?var0 dbo:Person ?var1 } UNION { ?var0 dbp:birthDate ?var1 } dbr:Halloween dbp:birthDate ?var1 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Person { ?var0 dbo:Person ?var1 } UNION { ?var1 dbp:birthDate ?var0 } dbr:Halloween dbp:birthDate ?var1 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:type dbr:Beer ; dbo:origin dbr:Beer }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Beer dbp:type ?var0 ; dbo:origin dbr:Beer }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Himalayas dbo:country ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:country dbr:Himalayas }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Actor { ?var0 dbo:Actor dbr:Germany } UNION { ?var0 dbo:Actor ?var1 . ?var1 dbo:Actor dbr:Germany } }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Actor { ?var0 dbo:Actor dbr:Germany } UNION { ?var1 dbo:Actor ?var0 . ?var1 dbo:Actor dbr:Germany } }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Peanut_butter dbp:carbs ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:carbs dbr:Peanut_butter }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var1 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:Film . ?var1 dbo:Film ?var0 . } ORDER BY DESC(COUNT(?var1)) OFFSET 0 LIMIT 1",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:Film <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> ?var1 . ?var1 dbo:Film ?var0 . } ORDER BY DESC(COUNT(?var1)) OFFSET 0 LIMIT 1"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Google dbo:numberOfEmployees ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:numberOfEmployees dbr:Google }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Actor ; dbo:Actor dbr:Berlin }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Berlin a dbo:Actor ; dbo:Actor ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Goofy dbo:creator ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:creator dbr:Goofy }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var1 dbo:album ?var0 ; <http:\/\/www.w3.org\/2000\/01\/rdf-schema#label> \"Last Christmas\"@en }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:album ?var1 ; <http:\/\/www.w3.org\/2000\/01\/rdf-schema#label> \"Last Christmas\"@en }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Alberta dbp:admittancedate ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:admittancedate dbr:Alberta }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 dbp:programme dbr:Soyuz_programme }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { dbr:Soyuz_programme dbp:programme ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:TelevisionShow ; dbo:TelevisionShow dbr:Neil_Patrick_Harris }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:TelevisionShow a ?var0 ; dbo:TelevisionShow dbr:Neil_Patrick_Harris }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Hells_Angels dbp:founded ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:founded dbr:Hells_Angels }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Apple_Inc. dbo:netIncome ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:netIncome dbr:Apple_Inc. }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Holiday ; dbo:Holiday dbr:Sweden }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Sweden a dbo:Holiday ; dbo:Holiday ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Juliana_of_the_Netherlands dbp:burialPlace ?var0 . ?var0 a dbo:Settlement }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:burialPlace dbr:Juliana_of_the_Netherlands . ?var0 a dbo:Settlement }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Musical ; dbo:Musical dbr:Leonard_Bernstein }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Leonard_Bernstein a dbo:Musical ; dbo:Musical ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 a dbo:Company { ?var0 dbo:Company dbr:Advertising } UNION { ?var0 dbo:Company ?var2 FILTER regex(?var2, \"advertising\", \"i\") } }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 a dbo:Company { dbr:Advertising dbo:Company ?var0 } UNION { ?var0 dbo:Company ?var2 FILTER regex(?var2, \"advertising\", \"i\") } }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Washington_(state) dbp:largestmetro ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:largestmetro dbr:Washington_(state) }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Person ; dbp:conviction dbr:Death_of_John_Lennon }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Death_of_John_Lennon a dbo:Person ; dbp:conviction ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Writer { ?var0 dbo:Writer ?var1 } UNION { ?var0 dbo:Writer ?var1 } { ?var1 dbo:Writer dbr:Istanbul } UNION { ?var1 dbp:city dbr:Istanbul } }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Writer { ?var0 dbo:Writer ?var1 } UNION { ?var0 dbo:Writer ?var1 } { dbr:Istanbul dbo:Writer ?var1 } UNION { ?var1 dbp:city dbr:Istanbul } }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Band ; dbo:Band dbr:Metalcore { ?var0 dbo:Band dbr:Metalcore } UNION { ?var0 dbo:Band ?var1 . ?var1 dbo:Band dbr:Metalcore } }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Band ; dbo:Band dbr:Metalcore { ?var0 dbo:Band dbr:Metalcore } UNION { ?var0 dbo:Band ?var1 . dbr:Metalcore dbo:Band ?var1 } }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Country { ?var0 dbo:Country dbr:Euro } UNION { ?var0 dbp:currencyCode \"EUR\"@en } }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbo:Country a ?var0 { ?var0 dbo:Country dbr:Euro } UNION { ?var0 dbp:currencyCode \"EUR\"@en } }"
  },
  {
    "output":"PREFIX yago: <http:\/\/dbpedia.org\/class\/yago\/> SELECT DISTINCT ?var0 WHERE { ?var0 a yago:WikicatEatingDisorders }",
    "input":"PREFIX yago: <http:\/\/dbpedia.org\/class\/yago\/> SELECT DISTINCT ?var0 WHERE { yago:WikicatEatingDisorders a ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> ASK WHERE { dbr:Marc_Chagall dbp:ethnicity \"Jewish\"@en }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> ASK WHERE { \"Jewish\"@en dbp:ethnicity dbr:Marc_Chagall }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Brazil_national_football_team dbp:fifaMin ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:fifaMin dbr:Brazil_national_football_team }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 a dbo:Film ; dbo:Film dbr:Leonardo_DiCaprio }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { dbo:Film a ?var0 ; dbo:Film dbr:Leonardo_DiCaprio }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> ASK WHERE { dbr:Margaret_Thatcher dbo:profession dbr:Margaret_Thatcher }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> ASK WHERE { dbr:Margaret_Thatcher dbo:profession dbr:Margaret_Thatcher }"
  },
  {
    "output":"PREFIX yago: <http:\/\/dbpedia.org\/class\/yago\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Utah dbp:timezone ?var1 . ?var0 a yago:WikicatStatesOfTheUnitedStates ; dbp:timezone ?var1 FILTER ( ?var0 != dbr:Utah ) }",
    "input":"PREFIX yago: <http:\/\/dbpedia.org\/class\/yago\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Utah dbp:timezone ?var1 . yago:WikicatStatesOfTheUnitedStates a ?var0 ; dbp:timezone ?var1 FILTER ( ?var0 != dbr:Utah ) }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Book ; dbo:Book dbr:Danielle_Steel }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Danielle_Steel a dbo:Book ; dbo:Book ?var0 }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:Country . ?var0 dbp:officialLanguages ?var1 . } ORDER BY DESC(COUNT(?var1)) OFFSET 0 LIMIT 1",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:Country . ?var1 dbp:officialLanguages ?var0 . } ORDER BY DESC(COUNT(?var1)) OFFSET 0 LIMIT 1"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:New_York_City_Fire_Department dbp:employees ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:employees dbr:New_York_City_Fire_Department }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Chewbacca dbo:portrayer ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:portrayer dbr:Chewbacca }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:ProgrammingLanguage { ?var0 dbo:ProgrammingLanguage dbr:Perl } UNION { dbr:Perl dbo:ProgrammingLanguage ?var0 } }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:ProgrammingLanguage a ?var0 { ?var0 dbo:ProgrammingLanguage dbr:Perl } UNION { dbr:Perl dbo:ProgrammingLanguage ?var0 } }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Mount_McKinley dbo:wikiPageRedirects ?var1 . ?var1 dbo:locatedInArea ?var0. ?var0 rdf:type yago:WikicatStatesOfTheUnitedStates }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Mount_McKinley dbo:wikiPageRedirects ?var1 . ?var1 dbo:locatedInArea ?var0. yago:WikicatStatesOfTheUnitedStates rdf:type ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Airline { ?var0 dbo:Airline dbr:SkyTeam } UNION { ?var0 dbo:Airline dbr:SkyTeam } }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Airline { ?var0 dbo:Airline dbr:SkyTeam } UNION { dbr:SkyTeam dbo:Airline ?var0 } }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:shipNamesake dbr:Benjamin_Franklin }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Benjamin_Franklin dbp:shipNamesake ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Politician ; dbo:Politician dbr:Methodism }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Methodism a dbo:Politician ; dbo:Politician ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT ?var0 WHERE { ?var0 dbo:author dbr:John_Green_(author) }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT ?var0 WHERE { dbr:John_Green_(author dbo:author ?var0) }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Mountain ; dbo:Mountain ?var1 } ORDER BY DESC(?var1) OFFSET 0 LIMIT 1",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var1 a dbo:Mountain ; dbo:Mountain ?var0 } ORDER BY DESC(?var1) OFFSET 0 LIMIT 1"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:occupation dbr:Poet . ?var1 dbo:occupation ?var0 . ?var1 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:occupation . } ORDER BY DESC(COUNT(?var1)) OFFSET 0 LIMIT 1",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:occupation dbr:Poet . ?var1 dbo:occupation ?var0 . ?var1 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:occupation . } ORDER BY DESC(COUNT(?var1)) OFFSET 0 LIMIT 1"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:ProgrammingLanguage ; dbo:ProgrammingLanguage dbr:JavaScript }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:JavaScript a dbo:ProgrammingLanguage ; dbo:ProgrammingLanguage ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:occupation dbr:Musician . ?var1 dbo:occupation ?var0 . ?var1 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:occupation . } ORDER BY DESC(COUNT(?var1)) OFFSET 0 LIMIT 1",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:occupation dbr:Musician . ?var0 dbo:occupation ?var1 . ?var1 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:occupation . } ORDER BY DESC(COUNT(?var1)) OFFSET 0 LIMIT 1"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:director dbr:Clint_Eastwood ; dbo:director dbr:Clint_Eastwood }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Clint_Eastwood dbo:director ?var0 ; dbo:director dbr:Clint_Eastwood }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Software . ?var1 a dbo:Software . ?var0 dbo:Software ?var1 . ?var1 dbo:Software dbr:California }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Software . ?var1 a dbo:Software . ?var1 dbo:Software ?var0 . ?var1 dbo:Software dbr:California }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 a dbo:Airline ; dbo:Airline dbr:Star_Alliance }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { dbr:Star_Alliance a dbo:Airline ; dbo:Airline ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX foaf:<http:\/\/xmlns.com\/foaf\/0.1\/> SELECT DISTINCT ?var0 WHERE { ?var0 foaf:surname 'Baldwin'@en . { ?var0 dbo:occupation dbr:Actor . } UNION { ?var0 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:occupation . } }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX foaf:<http:\/\/xmlns.com\/foaf\/0.1\/> SELECT DISTINCT ?var0 WHERE { dbr:Actor foaf:surname 'Baldwin'@en . { ?var0 dbo:occupation ?var0 . } UNION { ?var0 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:occupation . } }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:The_Hunger_Games dbp:author ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:author dbr:The_Hunger_Games }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var1 rdf:type dbo:Album ; dbo:artist dbr:Elvis_Presley ; dbo:releaseDate ?var2 ; dbo:recordLabel ?var0 } ORDER BY ASC(?var2) OFFSET 0 LIMIT 1",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbo:Album rdf:type ?var1 ; dbo:artist dbr:Elvis_Presley ; dbo:releaseDate ?var2 ; dbo:recordLabel ?var0 } ORDER BY ASC(?var2) OFFSET 0 LIMIT 1"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> ASK WHERE { dbr:Batman_Begins dbo:starring dbr:Christian_Bale }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> ASK WHERE { dbr:Christian_Bale dbo:starring dbr:Batman_Begins }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Prime_Minister_of_Spain dbp:residence ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:residence dbr:Prime_Minister_of_Spain }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:Actor . ?var1 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:Actor . ?var1 dbo:Actor ?var0 . } ORDER BY DESC(COUNT(DISTINCT(?var1))) OFFSET 0 LIMIT 1",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:Actor <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> ?var0 . ?var1 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:Actor . ?var1 dbo:Actor ?var0 . } ORDER BY DESC(COUNT(DISTINCT(?var1))) OFFSET 0 LIMIT 1"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Country ; dbo:Country ?var1 } GROUP BY ?var0 HAVING ( COUNT(?var1) > 2 )",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var1 a dbo:Country ; dbo:Country ?var0 } GROUP BY ?var0 HAVING ( COUNT(?var1) > 2 )"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Country . ?var1 a dbo:Country { ?var1 dbo:Country ?var0 } UNION { ?var1 dbo:Country ?var2 . ?var2 dbo:Country ?var0 } } GROUP BY ?var0 HAVING ( COUNT(?var1) > 10 )",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Country . ?var1 a dbo:Country { ?var1 dbo:Country ?var0 } UNION { ?var1 dbo:Country ?var2 . ?var0 dbo:Country ?var2 } } GROUP BY ?var0 HAVING ( COUNT(?var1) > 10 )"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:Song . ?var0 dbo:Song dbr:Bruce_Springsteen . ?var0 dbo:Song ?var1 . FILTER (?var1 >= '1980-01-01'^^xsd:date && ?var1 <= '1990-12-31'^^xsd:date) }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:Song . ?var0 dbo:Song dbr:Bruce_Springsteen . ?var1 dbo:Song ?var0 . FILTER (?var1 >= '1980-01-01'^^xsd:date && ?var1 <= '1990-12-31'^^xsd:date) }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:TelevisionShow ; dbo:TelevisionShow dbr:John_Cleese }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:TelevisionShow a ?var0 ; dbo:TelevisionShow dbr:John_Cleese }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Latvia dbp:accessioneudate ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:accessioneudate dbr:Latvia }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:SoccerPlayer ; dbo:SoccerPlayer dbr:Malta }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:SoccerPlayer a ?var0 ; dbo:SoccerPlayer dbr:Malta }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 dbo:profession dbr:Politician ; dbo:profession dbr:Politician }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { dbr:Politician dbo:profession dbr:Politician ; dbo:profession ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Charmed dbo:starring ?var1 . ?var1 dbo:starring ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var1 dbo:starring dbr:Charmed . ?var1 dbo:starring ?var0 }"
  }
]