[
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> SELECT ?var0 WHERE { ?var0 dbo:publisher dbr:GMT_Games }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> SELECT ?var0 WHERE { dbr:GMT_Games dbo:publisher ?var0 }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> SELECT DISTINCT ?var0 WHERE { dbr:Skype dbo:developer ?var0. }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:developer dbr:Skype. }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX yago: <http:\/\/dbpedia.org\/class\/yago\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Person ; dbo:birthPlace dbr:Heraklion. }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX yago: <http:\/\/dbpedia.org\/class\/yago\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:Person rdf:type ?var0 ; dbo:birthPlace dbr:Heraklion. }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> SELECT DISTINCT ?var0 WHERE { dbr:Area_51 dbo:location ?var0 . ?var0 dbo:country dbr:United_States. }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:location dbr:Area_51 . ?var0 dbo:country dbr:United_States. }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:New_York_City dbo:leaderName ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:leaderName dbr:New_York_City }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var1 rdf:type dbo:Cave ; dbo:location ?var0 . ?var0 rdf:type dbo:Country } GROUP BY ?var0 HAVING ( COUNT(?var1) > 2 )",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var1 rdf:type dbo:Cave ; dbo:location ?var0 . dbo:Country rdf:type ?var0 } GROUP BY ?var0 HAVING ( COUNT(?var1) > 2 )"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Air_China dbo:targetAirport ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:targetAirport dbr:Air_China }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var1 dbo:director dbr:William_Shatner ; dbo:starring dbr:William_Shatner { ?var1 dbo:starring ?var0 } UNION { ?var1 dbp:starring ?var0 } }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var1 dbo:director dbr:William_Shatner ; dbo:starring dbr:William_Shatner { ?var1 dbo:starring ?var0 } UNION { ?var0 dbp:starring ?var1 } }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Philippines dbo:officialLanguage ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:officialLanguage dbr:Philippines }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Film ; dbo:country dbr:Denmark }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbo:Film rdf:type ?var0 ; dbo:country dbr:Denmark }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Film ; dbo:starring dbr:Brad_Pitt ; dbo:director dbr:Guy_Ritchie }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbo:Film rdf:type ?var0 ; dbo:starring dbr:Brad_Pitt ; dbo:director dbr:Guy_Ritchie }"
  },
  {
    "output":"PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Bruce_Lee dbo:child ?var1 . ?var1 dbp:children ?var0 }",
    "input":"PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var1 dbo:child dbr:Bruce_Lee . ?var1 dbp:children ?var0 }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Weapon ; dbp:designer ?var1 . dbr:Uzi dbp:designer ?var1 FILTER ( ?var0 != dbr:Uzi ) }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var1 rdf:type dbo:Weapon ; dbp:designer ?var0 . dbr:Uzi dbp:designer ?var1 FILTER ( ?var0 != dbr:Uzi ) }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Universal_Studios dbo:owner ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:owner dbr:Universal_Studios }"
  },
  {
    "output":"PREFIX yago: <http:\/\/dbpedia.org\/class\/yago\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:densityrank ?var1 } ORDER BY ASC(?var1) LIMIT 1",
    "input":"PREFIX yago: <http:\/\/dbpedia.org\/class\/yago\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { yago:WikicatStatesOfTheUnitedStates rdf:type ?var0 ; dbp:densityrank ?var1 } ORDER BY ASC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Monarch ; dbo:spouse ?var1 { ?var1 dbo:birthPlace dbr:Germany } UNION { ?var1 dbo:birthPlace ?var2 . ?var2 dbo:country dbr:Germany } }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Monarch ; dbo:spouse ?var1 { ?var1 dbo:birthPlace dbr:Germany } UNION { ?var1 dbo:birthPlace ?var2 . dbr:Germany dbo:country ?var2 } }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Organisation { ?var0 dbo:formationYear ?var1 } UNION { ?var0 dbo:foundingYear ?var1 } UNION { ?var0 dbp:foundation ?var1 } UNION { ?var0 dbp:formation ?var1 } FILTER regex(?var1, \"^1950\") }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type dbo:Organisation { ?var0 dbo:formationYear ?var1 } UNION { ?var0 dbo:foundingYear ?var1 } UNION { ?var0 dbp:foundation ?var1 } UNION { ?var1 dbp:formation ?var0 } FILTER regex(?var1, \"^1950\") }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Captain_America dbo:creator ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:creator dbr:Captain_America }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:mission dbr:Apollo_14 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Apollo_14 dbo:mission ?var0 }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> SELECT DISTINCT ?var0 WHERE { dbr:The_Pillars_of_the_Earth dbo:author ?var0 }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:author dbr:The_Pillars_of_the_Earth }"
  },
  {
    "output":"PREFIX yago: <http:\/\/dbpedia.org\/class\/yago\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT ?var0 WHERE { ?var0 dbp:densityrank ?var1 } ORDER BY ASC(?var1) LIMIT 1",
    "input":"PREFIX yago: <http:\/\/dbpedia.org\/class\/yago\/> PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT ?var0 WHERE { ?var1 dbp:densityrank ?var0 } ORDER BY ASC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:launchPad dbr:Baikonur_Cosmodrome }",
    "input":"PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Baikonur_Cosmodrome dbp:launchPad ?var0 }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:occupation dbr:Bandleader ; dbo:instrument dbr:Trumpet }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Trumpet dbo:occupation dbr:Bandleader ; dbo:instrument ?var0 }"
  },
  {
    "output":"PREFIX yago: <http:\/\/dbpedia.org\/class\/yago\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { dbr:Utah dbp:timezone ?var1 . ?var0 rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:timezone ?var1 FILTER ( ?var0 != dbr:Utah ) }",
    "input":"PREFIX yago: <http:\/\/dbpedia.org\/class\/yago\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var1 dbp:timezone dbr:Utah . ?var0 rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:timezone ?var1 FILTER ( ?var0 != dbr:Utah ) }"
  },
  {
    "output":"PREFIX yago: <http:\/\/dbpedia.org\/class\/yago\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var0 rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:mineral ?var1 FILTER regex(?var1, \"gold\", \"i\") }",
    "input":"PREFIX yago: <http:\/\/dbpedia.org\/class\/yago\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX rdf: <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#> SELECT DISTINCT ?var0 WHERE { ?var1 rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:mineral ?var0 FILTER regex(?var1, \"gold\", \"i\") }"
  },
  {
    "output":"PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { dbr:Ingrid_Bergman dbo:child ?var1 . ?var1 dbp:spouse ?var0 }",
    "input":"PREFIX dbp: <http:\/\/dbpedia.org\/property\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> SELECT DISTINCT ?var0 WHERE { ?var1 dbo:child dbr:Ingrid_Bergman . ?var1 dbp:spouse ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Lake_Placid_(Texas) dbo:maximumDepth ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:maximumDepth dbr:Lake_Placid_(Texas) }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Museum ; dbo:Museum dbr:London }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:Museum a ?var0 ; dbo:Museum dbr:London }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Cave ; dbp:entranceCount ?var1 FILTER ( ?var1 > 3 ) }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var1 a dbo:Cave ; dbp:entranceCount ?var0 FILTER ( ?var1 > 3 ) }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:team dbr:Atlanta_Falcons ; dbo:team ?var1 } ORDER BY DESC(?var1) OFFSET 0 LIMIT 1",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Atlanta_Falcons dbo:team ?var0 ; dbo:team ?var1 } ORDER BY DESC(?var1) OFFSET 0 LIMIT 1"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 <http:\/\/purl.org\/dc\/terms\/subject> dbr:Category:Action_role-playing_video_games ; dbp:ign ?var1 } ORDER BY DESC(?var1) LIMIT 10",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var1 <http:\/\/purl.org\/dc\/terms\/subject> dbr:Category:Action_role-playing_video_games ; dbp:ign ?var0 } ORDER BY DESC(?var1) LIMIT 10"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:BasketballPlayer ; dbo:BasketballPlayer ?var1 FILTER ( ?var1 > 2.0 ) }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var1 a dbo:BasketballPlayer ; dbo:BasketballPlayer ?var0 FILTER ( ?var1 > 2.0 ) }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Statue_of_Liberty dbp:beginningDate ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:beginningDate dbr:Statue_of_Liberty }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Illinois dbp:borderingstates ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:borderingstates dbr:Illinois }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Minecraft dbo:developer ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:developer dbr:Minecraft }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Hillel_Slovak dbo:deathPlace ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:deathPlace dbr:Hillel_Slovak }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Film ; dbo:Film dbr:Jesse_Eisenberg }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Jesse_Eisenberg a dbo:Film ; dbo:Film ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Swimmer ; dbo:Swimmer dbr:Moscow }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:Swimmer a ?var0 ; dbo:Swimmer dbr:Moscow }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Astronaut { ?var0 dbo:Astronaut dbr:Russia } UNION { ?var0 dbo:Astronaut dbr:Russia } }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Astronaut { ?var0 dbo:Astronaut dbr:Russia } UNION { dbr:Russia dbo:Astronaut ?var0 } }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:type dbr:Nonprofit_organization { ?var0 dbo:type dbr:Nonprofit_organization } UNION { ?var0 dbo:type ?var1 . ?var1 dbo:type dbr:Nonprofit_organization } }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:type dbr:Nonprofit_organization { ?var0 dbo:type dbr:Nonprofit_organization } UNION { ?var0 dbo:type ?var1 . dbr:Nonprofit_organization dbo:type ?var1 } }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:President ; dbo:President ?var1 FILTER regex(?var1, \"^1945\") }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:President a ?var0 ; dbo:President ?var1 FILTER regex(?var1, \"^1945\") }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Lou_Reed dbo:genre ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:genre dbr:Lou_Reed }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Boston_Red_Sox dbp:ballpark ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:ballpark dbr:Boston_Red_Sox }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:SoccerClub ; dbo:SoccerClub dbr:Bundesliga }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Bundesliga a dbo:SoccerClub ; dbo:SoccerClub ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Volcano ; dbo:Volcano dbr:Japan ; dbo:Volcano ?var1 FILTER ( year(?var1) >= 2000 ) }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:Volcano a ?var0 ; dbo:Volcano dbr:Japan ; dbo:Volcano ?var1 FILTER ( year(?var1) >= 2000 ) }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Bridge ; dbo:Bridge dbr:Seine }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Seine a dbo:Bridge ; dbo:Bridge ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:University_of_Oxford dbo:officialSchoolColour ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:officialSchoolColour dbr:University_of_Oxford }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 dbo:producer dbr:Hal_Roach }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { dbr:Hal_Roach dbo:producer ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Film ; dbo:Film dbr:Denmark }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:Film a ?var0 ; dbo:Film dbr:Denmark }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var1 dbo:deathCause ?var0 . } ORDER BY DESC(COUNT(DISTINCT ?var1)) OFFSET 0 LIMIT 1",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:deathCause ?var1 . } ORDER BY DESC(COUNT(DISTINCT ?var1)) OFFSET 0 LIMIT 1"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:BasketballPlayer ; dbo:BasketballPlayer ?var1 ; dbp:highlights ?var2 FILTER regex(?var2, \"MVP\") } ORDER BY DESC(?var1) OFFSET 0 LIMIT 4",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var2 a dbo:BasketballPlayer ; dbo:BasketballPlayer ?var1 ; dbp:highlights ?var0 FILTER regex(?var2, \"MVP\") } ORDER BY DESC(?var1) OFFSET 0 LIMIT 4"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Company { ?var0 dbo:Company dbr:Munich } UNION { ?var0 dbo:Company dbr:Munich } UNION { ?var0 dbo:Company dbr:Munich } }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Company { ?var0 dbo:Company dbr:Munich } UNION { dbr:Munich dbo:Company ?var0 } UNION { ?var0 dbo:Company dbr:Munich } }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Himalayas dbo:country ?var1 . ?var1 dbo:country ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Himalayas dbo:country ?var1 . ?var0 dbo:country ?var1 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT COUNT(DISTINCT ?var0 AS ?var0) WHERE { ?var0 dbo:director dbr:Park_Chan-wook . }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT COUNT(DISTINCT ?var0 AS ?var0) WHERE { dbr:Park_Chan-wook dbo:director ?var0 . }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:River . ?var1 dbo:River ?var0 ; a dbo:River ; dbo:River dbr:Germany }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:River a ?var0 . ?var1 dbo:River ?var0 ; a dbo:River ; dbo:River dbr:Germany }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 a dbo:Airline }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { dbo:Airline a ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Island ; dbo:Island dbr:Japan }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Japan a dbo:Island ; dbo:Island ?var0 }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Maribor dbo:populationTotal ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:populationTotal dbr:Maribor }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Company { ?var0 dbo:Company ?var1 } UNION { ?var0 dbp:numEmployees ?var1 } FILTER ( ?var1 > 1000000 ) }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbo:Company a ?var0 { ?var0 dbo:Company ?var1 } UNION { ?var0 dbp:numEmployees ?var1 } FILTER ( ?var1 > 1000000 ) }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:Film ; dbo:Film dbr:Julia_Roberts ; dbo:Film dbr:Julia_Roberts }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:Film a ?var0 ; dbo:Film dbr:Julia_Roberts ; dbo:Film dbr:Julia_Roberts }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 a dbo:SoccerClub ; dbo:SoccerClub dbr:Premier_League }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:SoccerClub a ?var0 ; dbo:SoccerClub dbr:Premier_League }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Ural_Mountains dbp:highest ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:highest dbr:Ural_Mountains }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Wyoming dbp:governor ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbp:governor dbr:Wyoming }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Eiffel_Tower dbo:architect ?var1 . ?var1 dbp:almaMater ?var0 }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbr:Eiffel_Tower dbo:architect ?var1 . ?var0 dbp:almaMater ?var1 }"
  },
  {
    "output":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { ?var0 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:WorldHeritageSite . { ?var0 dbp:year '2013'^^xsd:integer . } UNION { ?var0 dbp:year '2014'^^xsd:integer . } }",
    "input":"PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> PREFIX dbp: <http:\/\/dbpedia.org\/property\/> SELECT DISTINCT ?var0 WHERE { dbo:WorldHeritageSite <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> ?var0 . { ?var0 dbp:year '2013'^^xsd:integer . } UNION { ?var0 dbp:year '2014'^^xsd:integer . } }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> dbo:Actor . ?var0 dbo:Actor dbr:Paris . ?var0 dbo:Actor ?var1 . FILTER ( ?var1 >= xsd:dateTime('1950-12-31T00:00:00Z')) }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbo:Actor <http:\/\/www.w3.org\/1999\/02\/22-rdf-syntax-ns#type> ?var0 . ?var0 dbo:Actor dbr:Paris . ?var0 dbo:Actor ?var1 . FILTER ( ?var1 >= xsd:dateTime('1950-12-31T00:00:00Z')) }"
  },
  {
    "output":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { ?var0 dbo:starring dbr:Elizabeth_Taylor ; dbo:starring dbr:Elizabeth_Taylor }",
    "input":"PREFIX dbr: <http:\/\/dbpedia.org\/resource\/> PREFIX dbo: <http:\/\/dbpedia.org\/ontology\/> SELECT DISTINCT ?var0 WHERE { dbr:Elizabeth_Taylor dbo:starring ?var0 ; dbo:starring dbr:Elizabeth_Taylor }"
  }
]