[
    {
        "input":"List all boardgames by GMT. [SEP] wd:board game [SEP] wdt:instance of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:instance of wd:board game . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who developed Skype? [SEP] wd:Skype [SEP] wdt:developer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Skype wdt:developer ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which people were born in Heraklion? [SEP] wd:Heraklion [SEP] wdt:place of birth",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:place of birth wd:Heraklion . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which U.S. state is Area 51 located? [SEP] wd:Area 51 [SEP] wdt:located in the administrative territorial entity",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Area 51 wdt:located in the administrative territorial entity ?var1 . ?var1 wdt:located in the administrative territorial entity ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the mayor of New York City? [SEP] wd:New York City [SEP] wdt:head of government",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:New York City wdt:head of government ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which airports does Air China serve? [SEP] wd:Air China [SEP] wdt:airline hub",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Air China wdt:airline hub ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all actors starring in movies directed by and starring William Shatner. [SEP] wd:William Shatner [SEP] wdt:cast member wdt:director",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var0 wdt:director wd:William Shatner ; wdt:cast member wd:William Shatner   . ?var0 wdt:cast member ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What are the official languages of the Philippines? [SEP] wd:Philippines [SEP] wdt:official language",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Philippines wdt:official language ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all Danish films. [SEP] wd:Denmark wd:film [SEP] wdt:country of origin wdt:instance of wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var0 wdt:subclass of* wd:film . ?var1 wdt:instance of ?var0 ; wdt:country of origin wd:Denmark . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which movies starring Brad Pitt were directed by Guy Ritchie? [SEP] wd:Brad Pitt wd:Guy Ritchie wd:film [SEP] wdt:instance of wdt:cast member wdt:director wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var0 wdt:subclass of* wd:film . ?var1 wdt:instance of ?var0 ; wdt:cast member wd:Brad Pitt ; wdt:director wd:Guy Ritchie . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me the grandchildren of Bruce Lee. [SEP] wd:Bruce Lee [SEP] wdt:child",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { wd:Bruce Lee wdt:child ?var0 . ?var0 wdt:child ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which other weapons did the designer of the Uzi develop? [SEP] wd:weapon wd:Uzi [SEP] wdt:designed by wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var2 WHERE { ?var1 wdt:subclass of* wd:weapon . wd:Uzi wdt:designed by ?var0 . ?var2 wdt:subclass of ?var1 ; wdt:designed by ?var0 . FILTER (?var2 != wd:Uzi) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the owner of Universal Studios? [SEP] wd:Universal Pictures [SEP] wdt:owned by",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Universal Pictures wdt:owned by ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which state of the USA has the highest population density? [SEP] wd:U.S. state [SEP] wdt:instance of wdt:population wdt:area",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var4 WHERE { ?var4 wdt:instance of wd:U.S. state ; wdt:area ?var3 ; wdt:population ?var1 . BIND((?var0) AS ?var2) . } ORDER BY DESC(?var2) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which monarchs were married to a German? [SEP] wd:monarch wd:Germany [SEP] wdt:spouse wdt:country of citizenship wdt:occupation",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:occupation wd:monarch ; wdt:spouse ?var0 . ?var0 wdt:country of citizenship wd:Germany . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which organizations were founded in 1950? [SEP] wd:organization [SEP] wdt:instance of wdt:inception wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var2 WHERE { ?var1 wdt:subclass of* wd:organization . ?var2 wdt:instance of ?var1 . ?var2 wdt:inception ?var0 . FILTER CONTAINS(STR(?var0), \"1950\") }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who created the comic Captain America? [SEP] wd:Captain America [SEP] wdt:creator",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Captain America wdt:creator ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me the Apollo 14 astronauts. [SEP] wd:Apollo 14 [SEP] wdt:crew member",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Apollo 14 wdt:crew member ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who wrote the book The pillars of the Earth? [SEP] wd:The Pillars of the Earth [SEP] wdt:author",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:The Pillars of the Earth wdt:author ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which spaceflights were launched from Baikonur? [SEP] wd:Baikonur Cosmodrome [SEP] wdt:start point",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:start point wd:Baikonur Cosmodrome }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me a list of all trumpet players that were bandleaders. [SEP] wd:conductor wd:trumpet [SEP] wdt:occupation wdt:instrument",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:conductor ; wdt:instrument wd:trumpet . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which U.S. states are in the same timezone as Utah? [SEP] wd:U.S. state wd:Utah [SEP] wdt:instance of wdt:located in time zone",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { wd:Utah wdt:located in time zone ?var0 . ?var1 wdt:instance of wd:U.S. state ; wdt:located in time zone ?var0 . FILTER(?var1 != wd:Utah) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the daughter of Ingrid Bergman married to? [SEP] wd:Ingrid Bergman [SEP] wdt:spouse wdt:child",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { wd:Ingrid Bergman wdt:child ?var0 . ?var0 wdt:spouse ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Show me all museums in London. [SEP] wd:museum wd:London [SEP] wdt:instance of wdt:location",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:instance of wd:museum . ?var0 wdt:location wd:London . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the tallest player of the Atlanta Falcons? [SEP] wd:Atlanta Falcons [SEP] wdt:height wdt:member of sports team",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:member of sports team wd:Atlanta Falcons ; wdt:height ?var0 . } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all writers that won the Nobel Prize in literature. [SEP] wd:writer wd:Nobel Prize in Literature [SEP] wdt:award received wdt:occupation",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:occupation wd:writer . ?var0 wdt:award received wd:Nobel Prize in Literature . } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Show me all basketball players that are higher than 2 meters. [SEP] wd:basketball player [SEP] wdt:occupation wdt:height",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:occupation wd:basketball player . ?var1 wdt:height ?var0 .  FILTER(?var0 > 200)}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"When was the Statue of Liberty built? [SEP] wd:Statue of Liberty [SEP] wdt:inception",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Statue of Liberty wdt:inception ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which states border Illinois? [SEP] wd:Illinois [SEP] wdt:shares border with",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Illinois wdt:shares border with ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who developed Minecraft? [SEP] wd:Minecraft [SEP] wdt:developer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Minecraft wdt:developer ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Where did Hillel Slovak die? [SEP] wd:Hillel Slovak [SEP] wdt:place of death",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Hillel Slovak wdt:place of death ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What movies does Jesse Eisenberg play in? [SEP] wd:None [SEP] wdt:cast member",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:cast member wd:None . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give all swimmers that were born in Moscow. [SEP] wd:swimmer wd:Moscow [SEP] wdt:occupation wdt:place of birth",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:swimmer ; wdt:place of birth wd:Moscow . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all cosmonauts. [SEP] wd:Soviet Union wd:astronaut wd:Russia [SEP] wdt:country of citizenship wdt:occupation",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0  wdt:occupation wd:astronaut . { ?var0 wdt:country of citizenship wd:Soviet Union } UNION { ?var0 wdt:country of citizenship wd:Russia } }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all Swiss non-profit organizations. [SEP] wd:nonprofit organization wd:municipality of Switzerland wd:Switzerland [SEP] wdt:instance of wdt:headquarters location",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of wd:nonprofit organization . { ?var1 wdt:headquarters location wd:Switzerland . } UNION { ?var1 wdt:headquarters location ?var0 . ?var0 wdt:instance of wd:municipality of Switzerland } }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which presidents were born in 1945? [SEP] wd:president [SEP] wdt:date of birth wdt:position held wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:position held\/wdt:subclass of wd:president . ?var1 wdt:date of birth ?var0 . FILTER(year(?var0)=1945) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What kind of music did Lou Reed play? [SEP] wd:Lou Reed [SEP] wdt:genre",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Lou Reed wdt:genre ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Where do the Red Sox play? [SEP] wd:Boston Red Sox [SEP] wdt:home venue",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Boston Red Sox wdt:home venue ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Show a list of soccer clubs that play in the Bundesliga. [SEP] wd:association football club wd:None [SEP] wdt:instance of wdt:league or competition",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:association football club ; wdt:league or competition wd:None . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which bridges cross the Seine? [SEP] wd:Seine wd:bridge [SEP] wdt:instance of wdt:crosses",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:bridge ; wdt:crosses wd:Seine . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many films did Hal Roach produce? [SEP] wd:Hal Roach [SEP] wdt:producer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(?var0) as ?var1) WHERE { ?var0 wdt:producer wd:Hal Roach . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the most frequent cause of death? [SEP]  [SEP] wdt:cause of death",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var1 wdt:cause of death ?var0 . } GROUP BY ?var0 ORDER BY DESC(COUNT(DISTINCT ?var1)) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who are the four youngest MVP basketball players? [SEP] wd:basketball player [SEP] wdt:award received wdt:date of birth wdt:occupation",
        "output":"PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var3 WHERE { ?var3 wdt:occupation wd:basketball player ; wdt:date of birth ?var1 ; wdt:award received ?var2 . ?var2 rdfs:label ?var0 FILTER (CONTAINS(STR(?var0), \"MVP\") || CONTAINS(STR(?var0), \"Most Valuable Player\")) . FILTER (LANGMATCHES(LANG(?var0), \"EN\" ) ) } ORDER BY DESC(?var1) LIMIT 4",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all companies in Munich. [SEP] wd:Munich wd:business [SEP] wdt:instance of wdt:subclass of wdt:headquarters location",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var0 wdt:subclass of* wd:business . ?var1 wdt:instance of ?var0 ; wdt:headquarters location wd:Munich . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me the capitals of all countries that the Himalayas run through. [SEP] wd:Himalayas [SEP] wdt:country wdt:capital",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { wd:Himalayas wdt:country ?var0 . ?var0 wdt:capital ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many movies did Park Chan-wook direct? [SEP] wd:Park Chan-wook [SEP] wdt:director",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var1) as ?var0) WHERE {  ?var1 wdt:director wd:Park Chan-wook . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which rivers flow into a German lake? [SEP] wd:lake wd:river [SEP] wdt:inflows wdt:instance of wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of wd:river . ?var0 wdt:instance of wd:lake ; wdt:country wd:183 . ?var1 wdt:inflows ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many airlines are there? [SEP] wd:airline [SEP] wdt:instance of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) AS ?var0) WHERE { ?var0 wdt:instance of wd:airline }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all islands that belong to Japan. [SEP] wd:island wd:Japan [SEP] wdt:instance of wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:island ; wdt:country wd:Japan . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many inhabitants does Maribor have? [SEP] wd:Maribor [SEP] wdt:population",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Maribor wdt:population ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which companies have more than 1 million employees? [SEP] wd:business [SEP] wdt:instance of wdt:employees wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var0 wdt:subclass of* wd:business . ?var1 wdt:instance of ?var0 ; wdt:employees ?var2 . FILTER(?var2 > 1000000) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which films directed by Garry Marshall was Julia Roberts starring? [SEP] wd:Julia Roberts wd:film wd:Garry Marshall [SEP] wdt:instance of wdt:cast member wdt:director",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:film . ?var0 wdt:director wd:Garry Marshall . ?var0 wdt:cast member wd:Julia Roberts . } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all soccer clubs in the Premier League. [SEP] wd:association football club wd:Premier League [SEP] wdt:instance of wdt:league or competition",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:association football club . ?var0 wdt:league or competition wd:Premier League . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the highest place of the Urals? [SEP] wd:Ural Mountains [SEP] wdt:highest point",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Ural Mountains wdt:highest point ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the governor of Wyoming? [SEP] wd:Wyoming [SEP] wdt:head of government",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Wyoming wdt:head of government ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Where did the architect of the Eiffel Tower study? [SEP] wd:Eiffel Tower [SEP] wdt:architect wdt:educated at",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Eiffel Tower wdt:architect ?var1 . ?var1 wdt:educated at ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all world heritage sites designated within the past two years. [SEP] wd:World Heritage Site [SEP] wdt:instance of wdt:time of discovery or invention",
        "output":"PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var3 WHERE { ?var3 wdt:instance of wd:World Heritage Site ; wdt:time of discovery or invention ?var1 . BIND(xsd:integer(YEAR(?var1)) as ?var2) . BIND(xsd:integer(YEAR(NOW())) as ?var0) . FILTER(?var2 < ?var0 && ?var2 < (?var0 - 2)) . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all actors who were born in Paris after 1950. [SEP] wd:actor wd:Paris [SEP] wdt:date of birth wdt:occupation wdt:place of birth",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var2 WHERE { ?var2 wdt:occupation wd:actor ; wdt:place of birth wd:Paris ; wdt:date of birth ?var1 . BIND(YEAR(?var1) as ?var0) . FILTER(?var0 > 1950) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which movies star both Liz Taylor and Richard Burton? [SEP] wd:Elizabeth Taylor wd:Richard Burton [SEP] wdt:cast member",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:cast member wd:Elizabeth Taylor . ?var0 wdt:cast member wd:Richard Burton . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all Australian nonprofit organizations. [SEP] wd:Australia wd:nonprofit organization [SEP] wdt:instance of wdt:headquarters location wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of wd:nonprofit organization . { ?var1 wdt:headquarters location|wdt:country wd:Australia . } UNION { ?var1 wdt:headquarters location|wdt:country ?var0 . ?var0 wdt:headquarters location wd:Australia } }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which pope succeeded John Paul II? [SEP] wd:pope wd:John Paul II [SEP] ",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE {  wd:John Paul II <http:\/\/www.wikidata.org\/prop\/P39> ?var0 . ?var0 <http:\/\/www.wikidata.org\/prop\/statement\/P39> wd:pope . ?var0 <http:\/\/www.wikidata.org\/prop\/qualifier\/P1366> ?var1 } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who was president of Pakistan in 1978? [SEP] wd:President of Pakistan [SEP] wdt:position held",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> SELECT DISTINCT ?var3 WHERE { ?var3 wdt:position held wd:President of Pakistan . ?var3 p:P39 ?var1 . ?var1 pq:P580 ?var0 ; pq:P582 ?var2 . FILTER(YEAR(?var0) <= 1978 && YEAR(?var2) >= 1978) . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the owner of Rolls-Royce? [SEP] wd:Rolls-Royce [SEP] wdt:owned by",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Rolls-Royce wdt:owned by ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many museums does Paris have? [SEP] wd:museum wd:Paris [SEP] wdt:instance of wdt:located in the administrative territorial entity",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:museum ; wdt:located in the administrative territorial entity wd:Paris . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    }
]