[
    {
        "input":"Are tree frogs a type of amphibian? [SEP] wd:Amphibia wd:Hylidae [SEP] wdt:parent taxon",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Hylidae wdt:parent taxon* wd:Amphibia . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the location of the Houses of Parliament? [SEP] wd:Palace of Westminster [SEP] wdt:located in the administrative territorial entity",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Palace of Westminster wdt:located in the administrative territorial entity ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"how much is the elevation of Dsseldorf Airport ? [SEP] wd:Dsseldorf Airport [SEP] wdt:elevation above sea level",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Dsseldorf Airport wdt:elevation above sea level ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How much is the population of mexico city ? [SEP] wd:Mexico City [SEP] wdt:population",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Mexico City wdt:population ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"when was the founding date of french fifth republic? [SEP] wd:French Fifth Republic [SEP] wdt:inception",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:French Fifth Republic wdt:inception ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who was the first King of England? [SEP] wd:monarch of England [SEP] wdt:position held",
        "output":"PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var2 WHERE { ?var2 wdt:position held wd:monarch of England . ?var2 p:P39 ?var1 . ?var1 pq:P580 ?var0 . } ORDER BY ?var0 LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the editor of Forbes? [SEP] wd:Forbes [SEP] wdt:editor",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Forbes wdt:editor ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which awards did Douglas Hofstadter win? [SEP] wd:Douglas Hofstadter [SEP] wdt:award received",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Douglas Hofstadter wdt:award received ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the youngest Darts player? [SEP] wd:darts player [SEP] wdt:date of birth wdt:occupation",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:occupation wd:darts player ; wdt:date of birth ?var0 . } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is horse racing a sport? [SEP] wd:sport wd:horse racing [SEP] wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:horse racing wdt:subclass of* wd:sport . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which river does the Brooklyn Bridge cross? [SEP] wd:Brooklyn Bridge [SEP] wdt:crosses",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Brooklyn Bridge wdt:crosses ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many people live in Poland? [SEP] wd:Poland [SEP] wdt:population",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Poland wdt:population ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"When was the last episode of the TV series Friends aired? [SEP] wd:Friends [SEP] wdt:end time",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Friends wdt:end time ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is the wife of president Obama called Michelle? [SEP] wd:None [SEP] wdt:spouse",
        "output":"PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:None wdt:spouse ?var0 . ?var0 rdfs:label ?var1 . FILTER regex(?var1, \"Michelle\") }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is 8th president of US? [SEP] wd:United States [SEP] ",
        "output":"PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var2 WHERE { wd:United States p:P6 ?var0 . ?var0 pq:P580 ?var1 ; ps:P6 ?var2 . } ORDER BY ?var1 OFFSET 7 LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"how much is the total population of european union? [SEP] wd:European Union [SEP] wdt:population",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:European Union wdt:population ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all launch pads operated by NASA. [SEP] wd:spaceport wd:National Aeronautics and Space Administration [SEP] wdt:instance of wdt:operator",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:spaceport ; wdt:operator wd:National Aeronautics and Space Administration . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who developed the video game World of Warcraft? [SEP] wd:World of Warcraft [SEP] wdt:developer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:World of Warcraft wdt:developer ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the birth name of Adele? [SEP] wd:Adele [SEP] wdt:birth name",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Adele wdt:birth name ?var0. }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the population of Cairo? [SEP] wd:Cairo [SEP] wdt:population",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Cairo wdt:population ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is Frank Herbert still alive? [SEP] wd:Frank Herbert [SEP] wdt:date of death",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Frank Herbert wdt:date of death ?var0 . FILTER(!BOUND(?var0)) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the last work of Dan Brown? [SEP] wd:Dan Brown [SEP] wdt:publication date wdt:author",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:author wd:Dan Brown ; wdt:publication date ?var0 . } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Where is Sungkyunkwan University? [SEP] wd:Sungkyunkwan University [SEP] wdt:located in the administrative territorial entity wdt:location wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { VALUES ?var1 { wdt:country wdt:location wdt:located in the administrative territorial entity } wd:Sungkyunkwan University ?var1 ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the author of the interpretation of dreams? [SEP] wd:The Interpretation of Dreams [SEP] wdt:author",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:The Interpretation of Dreams wdt:author ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"When was the death of Shakespeare? [SEP] wd:William Shakespeare [SEP] wdt:date of death",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:William Shakespeare wdt:date of death ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who developed Slack? [SEP] wd:Slack [SEP] wdt:product or material produced",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:product or material produced wd:Slack}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which year was Rachel Stevens born? [SEP] wd:Rachel Stevens [SEP] wdt:date of birth",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { wd:Rachel Stevens wdt:date of birth ?var0 . BIND(YEAR(?var0) as ?var1) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How often did Jane Fonda marry? [SEP] wd:Jane Fonda [SEP] wdt:spouse",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) as ?var1) WHERE { wd:Jane Fonda wdt:spouse ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Was the wife of president Lincoln called Mary? [SEP] wd:Abraham Lincoln [SEP] wdt:spouse",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Abraham Lincoln wdt:spouse ?var0 .  ?var0 <http:\/\/www.w3.org\/2000\/01\/rdf-schema#label> ?var1 .  FILTER(regex(?var1,'Mary')) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which programming language is GIMP written? [SEP] wd:GIMP [SEP] wdt:programmed in",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:GIMP wdt:programmed in ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which university did Angela Merkel attend? [SEP] wd:Angela Merkel wd:public university wd:university [SEP] wdt:instance of wdt:educated at",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { VALUES ?var0 { wd:university wd:public university } wd:Angela Merkel wdt:educated at ?var1 . ?var1 wdt:instance of ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"List all the musicals with music by Elton John. [SEP] wd:dramatico-musical work wd:None [SEP] wdt:instance of wdt:subclass of wdt:composer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of\/wdt:subclass of* wd:dramatico-musical work ; wdt:composer wd:None . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"When was John Adams born? [SEP] wd:John Adams [SEP] wdt:date of birth",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:John Adams wdt:date of birth ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which companies produce hovercrafts? [SEP] wd:hovercraft [SEP] wdt:instance of wdt:subclass of wdt:manufacturer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var0 wdt:instance of\/wdt:subclass of* wd:hovercraft ; wdt:manufacturer ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who was the wife of U.S. president Lincoln? [SEP] wd:Abraham Lincoln [SEP] wdt:spouse",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Abraham Lincoln wdt:spouse ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which species does an elephant belong? [SEP] wd:elephant [SEP] wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:elephant wdt:subclass of ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many people live in the capital of Australia? [SEP] wd:Australia [SEP] wdt:population wdt:capital",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Australia wdt:capital ?var1 . ?var1 wdt:population ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which ancient empire could you pay with cocoa beans? [SEP] wd:cocoa bean [SEP] wdt:currency",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:currency wd:cocoa bean . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many theories did Albert Einstein come up with? [SEP] wd:Albert Einstein [SEP] wdt:notable work",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) as ?var1) WHERE { wd:Albert Einstein wdt:notable work ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who composed the soundtrack for Cameron's Titanic? [SEP] wd:Titanic [SEP] wdt:composer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Titanic wdt:composer ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me the runtime of Toy Story. [SEP] wd:Toy Story [SEP] wdt:duration",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Toy Story wdt:duration ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"With how many countries Iran has borders? [SEP] wd:Iran [SEP] wdt:shares border with",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Iran wdt:shares border with ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which electronics companies were founded in Beijing? [SEP] wd:Beijing wd:consumer electronics [SEP] wdt:location of formation wdt:industry",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0  wdt:industry wd:consumer electronics ;  wdt:location of formation wd:Beijing . } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who was the successor of John F. Kennedy? [SEP] wd:John F. Kennedy wd:President of the United States [SEP] ",
        "output":"PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT ?var1 WHERE { wd:John F. Kennedy p:P39 ?var0 . ?var0 ps:P39 wd:President of the United States ; pq:P1366 ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the mayor of Paris? [SEP] wd:Paris [SEP] wdt:head of government",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Paris wdt:head of government ?var0  . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Did Arnold Schwarzenegger attend a university? [SEP] wd:Arnold Schwarzenegger wd:university [SEP] wdt:instance of wdt:subclass of wdt:educated at",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Arnold Schwarzenegger wdt:educated at ?var0 . ?var0 wdt:instance of\/wdt:subclass of* wd:university . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is James Bond married? [SEP] wd:James Bond [SEP] wdt:spouse",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:James Bond wdt:spouse ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Does the Isar flow into a lake? [SEP] wd:lake wd:Isar [SEP] wdt:instance of wdt:mouth of the watercourse",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Isar wdt:mouth of the watercourse ?var0 . ?var0 wdt:instance of wd:lake  . } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which Indian company has the most employees? [SEP] wd:India wd:business [SEP] wdt:employees wdt:instance of wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of wd:business  . ?var1 wdt:country wd:India . ?var1 wdt:employees ?var0 . } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who was John F. Kennedy's vice president? [SEP] wd:John F. Kennedy wd:Vice President of the United States wd:President of the United States [SEP] ",
        "output":"PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var6 WHERE { wd:John F. Kennedy p:P39 ?var1 . ?var1 ps:P39 wd:President of the United States ; pq:P580 ?var2 ; pq:P582 ?var4 . ?var6 p:P39 ?var0 . ?var0 ps:P39 wd:Vice President of the United States ; pq:P580 ?var3 ; pq:P582 ?var5 . FILTER(?var3 >= ?var2 && ?var3 <= ?var4) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which country does the creator of Miffy come from? [SEP] wd:Miffy [SEP] wdt:country of citizenship wdt:creator",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var1 WHERE { wd:Miffy wdt:creator ?var0 . ?var0 wdt:country of citizenship ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In what city is the Heineken brewery? [SEP] wd:Heineken [SEP] wdt:headquarters location wdt:manufacturer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Heineken wdt:manufacturer\/wdt:headquarters location ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is Barack Obama a democrat? [SEP] wd:Democratic Party wd:None [SEP] wdt:member of political party",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:None wdt:member of political party wd:Democratic Party . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"List the children of Margaret Thatcher. [SEP] wd:Margaret Thatcher [SEP] wdt:child",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Margaret Thatcher wdt:child ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"how big is the total area of North Rhine- Westphalia? [SEP] wd:North Rhine-Westphalia [SEP] wdt:area",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:North Rhine-Westphalia wdt:area ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which city has the most inhabitants? [SEP] wd:city [SEP] wdt:instance of wdt:population",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of\/wdt:279* wd:city ; wdt:population ?var0 . } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is Donald Trump's main business? [SEP] wd:Donald Trump wd:business [SEP] wdt:instance of wdt:subclass of wdt:chairperson wdt:dissolved, abolished or demolished date",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:chairperson wd:Donald Trump ; wdt:instance of\/wdt:subclass of* wd:business . MINUS { ?var1 wdt:dissolved, abolished or demolished date ?var0 } }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"When will start the final match of the football world cup 2018? [SEP] wd:2018 FIFA World Cup [SEP] wdt:start time wdt:final event",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { wd:2018 FIFA World Cup wdt:final event ?var0 . ?var0 wdt:start time ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which films did Stanley Kubrick direct? [SEP] wd:Stanley Kubrick [SEP] wdt:director",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:director wd:Stanley Kubrick}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"how much is the population Iraq? [SEP] wd:Iraq [SEP] wdt:population",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Iraq wdt:population ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many inhabitants does the largest city in Canada have? [SEP] wd:city wd:Canada [SEP] wdt:instance of wdt:population wdt:subclass of wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:country wd:Canada ; wdt:instance of\/wdt:subclass of* wd:city ; wdt:population ?var0 } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the mayor of the capital of French Polynesia? [SEP] wd:French Polynesia [SEP] wdt:head of government wdt:capital",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { wd:French Polynesia wdt:capital ?var0 . ?var0 wdt:head of government ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all actors starring in movies directed by William Shatner. [SEP] wd:William Shatner wd:film [SEP] wdt:instance of wdt:cast member wdt:director",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var0 wdt:instance of wd:film ; wdt:director wd:William Shatner  ; wdt:cast member ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How tall is Claudia Schiffer? [SEP] wd:Claudia Schiffer [SEP] wdt:height",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Claudia Schiffer wdt:height ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the highest mountain in Italy? [SEP] wd:Italy wd:mountain [SEP] wdt:instance of wdt:elevation above sea level wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of wd:mountain ; wdt:country wd:Italy ; wdt:elevation above sea level ?var0 . } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"List all games by GMT. [SEP] wd:game wd:GMT Games [SEP] wdt:instance of wdt:publisher wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of\/wdt:subclass of* wd:game ; wdt:publisher wd:GMT Games . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    }
]