[
    {
        "input":"What is the longest river? [SEP] wd:metre wd:river [SEP] wdt:instance of",
        "output":"PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var14 WHERE { ?var14 wdt:instance of wd:river . ?var14 p:P2043 ?var10. ?var10 psv:P2043 ?var8 . ?var8 wikibase:quantityAmount ?var12 . ?var8 wikibase:quantityUnit ?var13 . ?var8 wikibase:quantityLowerBound ?var6. ?var8 wikibase:quantityUpperBound ?var5. BIND((?var0)\/2 AS ?var9). BIND(IF(?var3, ?var12, (CONCAT(str(?var12), \"\", str(?var9)))) AS ?var11). ?var13 p:P2370 ?var2 . ?var2 psv:P2370 ?var1 . ?var1 wikibase:quantityAmount ?var7 . ?var1 wikibase:quantityUnit wd:metre . BIND(?var12 * ?var7 AS ?var4) . } ORDER BY DESC(?var4) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which organizations were founded in 1930? [SEP] wd:organization [SEP] wdt:instance of wdt:located in the administrative territorial entity wdt:inception",
        "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT * WHERE { ?var1 wdt:inception ?var0 . ?var1 wdt:instance of\/wdt:located in the administrative territorial entity* wd:organization . FILTER(year(?var0) = 1930) . } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the birth name of Angela Merkel? [SEP] wd:Angela Merkel [SEP] wdt:birth name",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Angela Merkel wdt:birth name ?var0 . } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who has Tom Cruise been married to? [SEP] wd:Tom Cruise [SEP] wdt:spouse",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Tom Cruise wdt:spouse ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which weapons did Heckler & Koch develop? [SEP] wd:Heckler & Koch wd:weapon family [SEP] wdt:instance of wdt:subclass of wdt:manufacturer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:manufacturer wd:Heckler & Koch . ?var0 wdt:subclass of*\/wdt:instance of wd:weapon family . } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the smallest city by area in Germany? [SEP] wd:city wd:Germany [SEP] wdt:instance of wdt:population wdt:subclass of wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var1 WHERE { ?var1 wdt:country wd:Germany . ?var1 wdt:instance of\/wdt:subclass of* wd:city . ?var1 wdt:population ?var0 . } ORDER BY ?var0 LIMIt 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the ruling party in Lisbon? [SEP] wd:human wd:Mayor of Lisbon [SEP] wdt:instance of wdt:member of political party",
        "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT ?var2 WHERE { ?var0 wdt:instance of wd:human . ?var0 p:P39 _:a ._:a ps:P39 wd:Mayor of Lisbon ._:a pq:P580 ?var1 . ?var0 wdt:member of political party ?var2 . } ORDER BY DESC(?var1) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How heavy is Jupiter's lightest moon? [SEP] wd:moon of Jupiter [SEP] wdt:instance of wdt:mass",
        "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT * WHERE { ?var1 wdt:instance of wd:moon of Jupiter . ?var1 wdt:mass ?var0 . } ORDER BY ?var0 LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many employees does IBM have? [SEP] wd:None [SEP] wdt:employees",
        "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT ?var0 WHERE { wd:None wdt:employees ?var0 . } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"List all episodes of the first season of the HBO television series The Sopranos! [SEP] wd:The Sopranos, season 1 [SEP] wdt:season",
        "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT (COUNT(?var0) AS ?var1) WHERE { ?var0 wdt:season wd:The Sopranos, season 1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Does the new Battlestar Galactica series have more episodes than the old one? [SEP] wd:Battlestar Galactica wd:Battlestar Galactica [SEP] wdt:number of episodes",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Battlestar Galactica wdt:number of episodes ?var0 . wd:Battlestar Galactica wdt:number of episodes ?var1 . FILTER (?var0 > ?var1) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all films produced by Hal Roach. [SEP] wd:film wd:Hal Roach [SEP] wdt:instance of wdt:producer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:film . ?var0 wdt:producer wd:Hal Roach . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who played Agent Smith in Matrix? [SEP] wd:Agent Smith wd:The Matrix [SEP] ",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT ?var0 WHERE { wd:The Matrix p:P161 _:a ._:a pq:P453 wd:Agent Smith ._:a ps:P161 ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which Greek parties are pro-European? [SEP] wd:Greece wd:pro-Europeanism wd:political party [SEP] wdt:instance of wdt:political ideology wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:political party ; wdt:country wd:Greece ; wdt:political ideology wd:pro-Europeanism . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me a list of all bandleaders that play trumpet. [SEP] wd:trumpet wd:bandleader [SEP] wdt:occupation wdt:instrument",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:occupation wd:bandleader . ?var0 wdt:instrument wd:trumpet . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the second highest mountain on Earth? [SEP] wd:Earth wd:mountain [SEP] wdt:part of wdt:instance of wdt:subclass of wdt:continent wdt:elevation above sea level",
        "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT ?var1 WHERE { ?var1 wdt:instance of\/wdt:subclass of* wd:mountain . ?var1 wdt:elevation above sea level ?var0 . ?var1 wdt:continent\/wdt:part of wd:Earth . } ORDER BY DESC(?var0) LIMIT 1 OFFSET 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is Egypts largest city also its capital? [SEP] wd:Egypt wd:city [SEP] wdt:instance of wdt:population wdt:capital wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { { SELECT ?var1 WHERE { ?var1 wdt:instance of wd:city . ?var1 wdt:country wd:Egypt . ?var1 wdt:population ?var0 . } ORDER BY DESC(?var0) LIMIT 1 } wd:Egypt wdt:capital ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which rockets were launched from Baikonur? [SEP] wd:Baikonur Cosmodrome wd:rocket [SEP] wdt:start point wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:subclass of* wd:rocket . ?var0 wdt:start point wd:Baikonur Cosmodrome  . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many programming languages are there? [SEP] wd:programming language [SEP] wdt:instance of wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var1) AS ?var0) WHERE { ?var1 wdt:instance of\/wdt:subclass of* wd:programming language . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which Chess players died in the same place they were born in? [SEP] wd:chess player [SEP] wdt:place of death wdt:subclass of wdt:occupation wdt:place of birth",
        "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:place of birth _:a . ?var0 wdt:place of death _:a . ?var0 wdt:occupation\/wdt:subclass of* wd:chess player . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the owner of Facebook? [SEP] wd:Meta [SEP] wdt:owned by",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Meta wdt:owned by ?var0 . } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which U.S. state is Fort Knox located? [SEP] wd:Fort Knox wd:U.S. state [SEP] wdt:instance of wdt:located in the administrative territorial entity",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Fort Knox wdt:located in the administrative territorial entity+ ?var0 . ?var0 wdt:instance of wd:U.S. state . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all cities in New Jersey with more than 100000 inhabitants. [SEP] wd:city wd:New Jersey [SEP] wdt:instance of wdt:located in the administrative territorial entity wdt:population",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of wd:city . ?var1 wdt:located in the administrative territorial entity+ wd:New Jersey . ?var1 wdt:population ?var0 . FILTER(?var0 > 100000) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which mountains are higher than the Nanga Parbat? [SEP] wd:Nanga Parbat wd:metre wd:mountain [SEP] wdt:instance of wdt:elevation above sea level",
        "output":"PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var5 WHERE { ?var5 wdt:instance of wd:mountain . ?var5 p:P2044 ?var3. ?var3 psv:P2044 ?var2 . ?var2 wikibase:quantityAmount ?var1 . ?var2 wikibase:quantityUnit ?var4 . wd:Nanga Parbat wdt:elevation above sea level ?var0 . FILTER(?var4 = wd:metre) FILTER (?var1 > ?var0) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"When was Olof Palme shot? [SEP] wd:Olof Palme [SEP] ",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Olof Palme <http:\/\/www.wikidata.org\/prop\/P570> ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"List the seven kings of Rome. [SEP] wd:King of Rome [SEP] wdt:position held",
        "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT * WHERE { ?var0 wdt:position held wd:King of Rome . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all people that were born in Vienna and died in Berlin. [SEP] wd:Berlin wd:Vienna [SEP] wdt:place of death wdt:located in the administrative territorial entity wdt:place of birth",
        "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT ?var0 WHERE {{ ?var0 wdt:place of birth\/wdt:located in the administrative territorial entity* wd:Vienna . { SELECT ?var0 WHERE { ?var0 wdt:place of death wd:Berlin . }}} UNION { ?var0 wdt:place of death\/wdt:located in the administrative territorial entity* wd:Berlin . { SELECT ?var0 WHERE { ?var0 wdt:place of birth wd:Vienna . }}} UNION { ?var0 wdt:place of birth\/wdt:located in the administrative territorial entity+ wd:Vienna . { SELECT ?var0 WHERE { ?var0 wdt:place of death\/wdt:located in the administrative territorial entity+ wd:Berlin . }}}}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is Darth Vader Lukes father? [SEP] wd:Darth Vader wd:Luke Skywalker [SEP] wdt:child",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Darth Vader wdt:child wd:Luke Skywalker . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Show me all the breweries in Australia. [SEP] wd:Australia wd:brewery [SEP] wdt:instance of wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:brewery . ?var0 wdt:country wd:Australia . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all films produced by Steven Spielberg with a budget of at least $80 million. [SEP] wd:Steven Spielberg wd:film [SEP] wdt:instance of wdt:subclass of wdt:capital cost wdt:producer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:producer wd:Steven Spielberg ; wdt:instance of\/wdt:subclass of* wd:film ; wdt:capital cost ?var0 . FILTER(?var0 > 80000000)}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all soccer clubs in Spain. [SEP] wd:association football club wd:Spain [SEP] wdt:instance of wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:association football club . ?var0 wdt:country wd:Spain . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who produced films starring Natalie Portman? [SEP] wd:film wd:Natalie Portman [SEP] wdt:instance of wdt:cast member wdt:producer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var0 wdt:instance of wd:film . ?var0 wdt:cast member wd:Natalie Portman . ?var0 wdt:producer ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all breeds of the German Shepherd dog. [SEP] wd:German Shepherd [SEP] wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:subclass of* wd:German Shepherd FILTER(?var0 != wd:German Shepherd) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the heaviest player of the Chicago Bulls? [SEP] wd:Chicago Bulls wd:kilogram [SEP] wdt:work period (end) wdt:member of sports team",
        "output":"PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var10 ?var1 WHERE { ?var10 wdt:member of sports team wd:Chicago Bulls ; p:P54 ?var0 . ?var0 a wikibase:BestRank; ?var11 wd:Chicago Bulls ; pq:P580 ?var3 . MINUS { ?var0 pq:P582 ?var5 . } MINUS { ?var10 wdt:work period (end) ?var4 . } ?var10 p:P2067 ?var6 . ?var6 psv:P2067 ?var2 . ?var2 wikibase:quantityAmount ?var9 . ?var2 wikibase:quantityUnit ?var8 . BIND(IF(?var8 = wd:kilogram, ?var9, ?var7.453592) AS ?var1) } ORDER BY DESC(?var1)",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the largest country in the world? [SEP] wd:country [SEP] wdt:instance of wdt:area",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> prefix rdfs:   <http:\/\/www.w3.org\/2000\/01\/rdf-schema#>  SELECT DISTINCT * WHERE { ?var2 wdt:instance of wd:country . ?var2 wdt:area ?var1 . ?var2 rdfs:label ?var0 } ORDER BY DESC(?var1) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the largest city in america? [SEP] wd:city wd:United States [SEP] wdt:instance of wdt:population wdt:subclass of wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var1 WHERE { ?var1 wdt:country wd:United States . ?var1 wdt:instance of\/wdt:subclass of* wd:city . ?var1 wdt:population ?var0 . } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who was the pope that founded the Vatican Television? [SEP] wd:pope wd:Vatican Media [SEP] wdt:inception wdt:position held",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/>  SELECT ?var3 WHERE { wd:Vatican Media wdt:inception ?var0 . ?var3 wdt:position held wd:pope . ?var3 p:P39 _:a . _:a ps:P39 wd:pope . _:a pq:P580 ?var1 . _:a pq:P582 ?var2 . FILTER( ?var1 <= ?var0 && ?var0 <= ?var2) . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who discovered Ceres? [SEP] wd:Ceres [SEP] wdt:discoverer or inventor",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Ceres wdt:discoverer or inventor ?var0  . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the king of the Netherlands? [SEP] wd:Netherlands wd:King of the Netherlands [SEP] wdt:position held wdt:head of state",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Netherlands wdt:head of state ?var0 . ?var0 wdt:position held wd:King of the Netherlands . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is Cola a beverage? [SEP] wd:cola wd:drink [SEP] wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:cola wdt:subclass of+ wd:drink . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the alma mater of the chancellor of Germany Angela Merkel? [SEP] wd:Angela Merkel wd:university [SEP] wdt:instance of wdt:subclass of wdt:educated at",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Angela Merkel wdt:educated at ?var0 . ?var0 wdt:instance of\/wdt:subclass of* wd:university . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which airports does Yeti Airlines serve? [SEP] wd:Yeti Airlines [SEP] wdt:airline hub",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Yeti Airlines wdt:airline hub ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Where is the birthplace of Goethe? [SEP] wd:Johann Wolfgang von Goethe [SEP] wdt:place of birth",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Johann Wolfgang von Goethe wdt:place of birth ?var0 . } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Was the Cuban Missile Crisis earlier than the Bay of Pigs Invasion? [SEP] wd:Bay of Pigs invasion wd:Cuban Missile Crisis [SEP] wdt:start time wdt:end time",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Cuban Missile Crisis wdt:end time ?var1 . wd:Bay of Pigs invasion wdt:start time ?var0 . FILTER(?var1 < ?var0) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which ingredients do I need for carrot cake? [SEP] wd:carrot cake [SEP] wdt:has part(s)",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:carrot cake wdt:has part(s) ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who created Wikipedia? [SEP] wd:Wikipedia [SEP] wdt:founded by",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Wikipedia wdt:founded by ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the highest mountain in Saxony Germany? [SEP] wd:mountain wd:Saxony [SEP] wdt:instance of wdt:located in the administrative territorial entity wdt:elevation above sea level",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var1 WHERE { ?var1 wdt:instance of wd:mountain . ?var1 wdt:located in the administrative territorial entity+ wd:Saxony . ?var1 wdt:elevation above sea level ?var0 . } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the current federal minister of finance in Germany? [SEP] wd:Federal Minister of Finance [SEP] ",
        "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/>  SELECT ?var1 WHERE { ?var1 p:P39 _:a . _:a ps:P39 wd:Federal Minister of Finance . :a pq:P580 ?var0 . } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which country is Mecca located? [SEP] wd:country wd:Mecca [SEP] wdt:instance of wdt:located in the administrative territorial entity",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Mecca wdt:located in the administrative territorial entity+ ?var0 . ?var0 wdt:instance of wd:country . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who played Gus Fring in Breaking Bad? [SEP] wd:Gus Fring [SEP] ",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Gus Fring ^<http:\/\/www.wikidata.org\/prop\/qualifier\/P453>\/<http:\/\/www.wikidata.org\/prop\/statement\/P161> ?var0 } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which country does the Nile start? [SEP] wd:Nile [SEP] wdt:origin of the watercourse wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Nile wdt:origin of the watercourse\/wdt:country ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which state Penn State University is located? [SEP] wd:Pennsylvania State University wd:state [SEP] wdt:instance of wdt:located in the administrative territorial entity wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Pennsylvania State University wdt:located in the administrative territorial entity ?var0 . ?var0 wdt:instance of\/wdt:subclass of* wd:state . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the biggest stadium in Spain? [SEP] wd:stadium wd:Spain [SEP] wdt:instance of wdt:subclass of wdt:maximum capacity wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { { ?var1 wdt:instance of wd:stadium .  } UNION { ?var1 wdt:instance of ?var0 . ?var0 wdt:subclass of wd:stadium } ?var1 wdt:country wd:Spain .  ?var1 wdt:maximum capacity ?var2 .  } ORDER BY DESC(?var2) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How large is the area of UK? [SEP] wd:United Kingdom [SEP] wdt:area",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:United Kingdom wdt:area ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who created Batman? [SEP] wd:Batman [SEP] wdt:creator",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Batman wdt:creator ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Was Sigmund Freud married? [SEP] wd:Sigmund Freud [SEP] wdt:spouse",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Sigmund Freud wdt:spouse ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who are the developers of DBpedia? [SEP] wd:DBpedia [SEP] wdt:founded by",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:DBpedia wdt:founded by ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all movies directed by Francis Ford Coppola. [SEP] wd:film wd:Francis Ford Coppola [SEP] wdt:instance of wdt:director wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of\/wdt:subclass of* wd:film ; wdt:director wd:Francis Ford Coppola . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    }
]