[
    {
        "input":"Where was JFK assassinated? [SEP] wd:John F. Kennedy [SEP] wdt:place of death",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:John F. Kennedy wdt:place of death ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all federal chancellors of Germany. [SEP] wd:Federal Chancellor of Germany [SEP] wdt:position held",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:position held wd:Federal Chancellor of Germany . } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which beer originated in Ireland? [SEP] wd:Ireland wd:beer brand wd:beer [SEP] wdt:instance of wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { VALUES ?var0 { wd:beer wd:beer brand } ?var1 wdt:instance of ?var0 ; wdt:country wd:Ireland . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"To which countries does the Himalayan mountain system extend? [SEP] wd:Himalayas [SEP] wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Himalayas wdt:country ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which actors were born in Germany? [SEP] wd:film actor wd:Germany [SEP] wdt:country wdt:place of birth wdt:occupation",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:film actor . { ?var0 wdt:place of birth wd:Germany . } UNION { ?var0 wdt:place of birth\/wdt:country wd:Germany . } }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who produced the most films? [SEP] wd:film [SEP] wdt:instance of wdt:producer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var0 wdt:instance of wd:film . ?var0 wdt:producer ?var1 . } GROUP BY ?var1 ORDER BY DESC(COUNT(?var0)) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many employees does Google have? [SEP] wd:Google [SEP] wdt:employees",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Google wdt:employees ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all actors who were born in Berlin. [SEP] wd:Berlin wd:actor [SEP] wdt:place of birth wdt:occupation",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:actor ; wdt:place of birth wd:Berlin . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who created Goofy? [SEP] wd:Goofy [SEP] wdt:creator",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Goofy wdt:creator ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which music albums contain the song Last Christmas? [SEP] wd:album wd:studio album wd:Last Christmas [SEP] wdt:part of wdt:instance of wdt:tracklist wdt:form of creative work",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { { wd:Last Christmas wdt:part of ?var1 . } UNION { VALUES ?var0 { wd:album wd:studio album } ?var1 wdt:instance of|wdt:form of creative work ?var0 ; wdt:tracklist wd:Last Christmas . }}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"When was Alberta admitted as province? [SEP] wd:Alberta [SEP] wdt:inception",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Alberta wdt:inception ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many missions does the Soyuz programme have? [SEP] wd:Soyuz programme [SEP] wdt:part of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 wdt:part of wd:Soyuz programme }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all the TV shows with Neil Patrick Harris. [SEP] wd:Neil Patrick Harris wd:television program [SEP] wdt:instance of wdt:cast member wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var1 WHERE { ?var0 wdt:subclass of* wd:television program . ?var1 wdt:cast member wd:Neil Patrick Harris . ?var1 wdt:instance of ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"When were the Hells Angels founded? [SEP] wd:Hells Angels [SEP] wdt:inception",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Hells Angels wdt:inception ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the net income of Apple? [SEP] wd:Apple Inc. [SEP] wdt:net profit",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Apple Inc. wdt:net profit ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all Swedish holidays. [SEP] wd:public holidays in Sweden [SEP] wdt:instance of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:instance of wd:public holidays in Sweden . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which city was the former Dutch queen Juliana buried? [SEP] wd:Juliana of the Netherlands [SEP] wdt:place of burial",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Juliana of the Netherlands wdt:place of burial ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"List all the musicals with music by Leonard Bernstein. [SEP] wd:Leonard Bernstein wd:musical [SEP] wdt:instance of wdt:composer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:musical ; wdt:composer wd:Leonard Bernstein . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all companies in the advertising industry. [SEP] wd:marketing wd:business [SEP] wdt:instance of wdt:industry",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:business ; wdt:industry wd:marketing . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who killed John Lennon? [SEP] wd:John Lennon [SEP] wdt:killed by",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:John Lennon wdt:killed by ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which writers studied in Istanbul? [SEP] wd:Istanbul wd:writer [SEP] wdt:located in the administrative territorial entity wdt:educated at wdt:occupation",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:writer . ?var0 wdt:educated at\/wdt:located in the administrative territorial entity  wd:Istanbul . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all Australian metalcore bands. [SEP] wd:Australia wd:metalcore wd:musical group [SEP] wdt:country of origin wdt:instance of wdt:genre",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:musical group ; wdt:country of origin wd:Australia ; wdt:genre wd:metalcore . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which countries adopted the Euro? [SEP] wd:euro wd:country [SEP] wdt:instance of wdt:currency",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:country . ?var0 wdt:currency wd:euro   . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all types of eating disorders. [SEP] wd:eating disorder [SEP] wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:subclass of wd:eating disorder . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Was Marc Chagall a jew? [SEP] wd:Marc Chagall wd:Jewish people [SEP] wdt:ethnic group",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Marc Chagall wdt:ethnic group wd:Jewish people . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What was Brazil's lowest rank in the FIFA World Ranking? [SEP] wd:FIFA World Rankings wd:Brazil men's national football team [SEP] ",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT ?var1 WHERE { wd:Brazil men's national football team p:P1352 ?var0 . ?var0 pq:P459 wd:FIFA World Rankings ; ps:P1352 ?var1 . } ORDER BY DESC(?var1) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many films did Leonardo DiCaprio star in? [SEP] wd:film wd:Leonardo DiCaprio [SEP] wdt:instance of wdt:cast member",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 wdt:instance of wd:film ; wdt:cast member wd:Leonardo DiCaprio . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Was Margaret Thatcher a chemist? [SEP] wd:chemist wd:Margaret Thatcher [SEP] wdt:occupation",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Margaret Thatcher wdt:occupation wd:chemist . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all books written by Danielle Steel. [SEP] wd:Danielle Steel wd:book [SEP] wdt:instance of wdt:author",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:book . ?var0 wdt:author wd:Danielle Steel . } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which country has the most official languages? [SEP] wd:country [SEP] wdt:instance of wdt:official language",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of wd:country . ?var1 wdt:official language ?var0 . } GROUP BY ?var1 ORDER BY DESC(COUNT(?var0)) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which actor played Chewbacca? [SEP] wd:Chewbacca [SEP] wdt:performer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Chewbacca wdt:performer ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all libraries established earlier than 1400. [SEP] wd:library [SEP] wdt:instance of wdt:inception",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of wd:library ; wdt:inception ?var0 . FILTER (YEAR(?var0) < 1400 ) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which programming languages were influenced by Perl? [SEP] wd:programming language wd:None [SEP] wdt:instance of wdt:influenced by",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:programming language ; wdt:influenced by wd:None . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which U.S. state is Mount McKinley located? [SEP] wd:Denali [SEP] wdt:located in the administrative territorial entity",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Denali wdt:located in the administrative territorial entity ?var0}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What airlines are part of the SkyTeam alliance? [SEP] wd:SkyTeam [SEP] wdt:airline alliance",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:airline alliance wd:SkyTeam . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all Methodist politicians. [SEP] wd:Methodism wd:politician [SEP] wdt:occupation wdt:religion or worldview",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:politician ; wdt:religion or worldview wd:Methodism . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What other books have been written by the author of The Fault in Our Stars? [SEP] wd:The Fault in Our Stars [SEP] wdt:author",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { wd:The Fault in Our Stars wdt:author ?var0 . ?var1 wdt:author ?var0 . FILTER(?var1 != wd:The Fault in Our Stars) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the highest mountain? [SEP] wd:mountain [SEP] wdt:instance of wdt:elevation above sea level",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of wd:mountain ; wdt:elevation above sea level ?var0 . } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which poet wrote the most books? [SEP] wd:book wd:poet [SEP] wdt:instance of wdt:author wdt:occupation",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 (COUNT(?var1) as ?var2 ) WHERE { ?var0  wdt:occupation  wd:poet . ?var1  wdt:author  ?var0 . ?var1  wdt:instance of  wd:book .  } GROUP BY ?var0 ORDER BY DESC(COUNT(?var1)) OFFSET 0 LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which programming languages influenced Javascript? [SEP] wd:None [SEP] wdt:influenced by",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:None wdt:influenced by ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which musician wrote the most books? [SEP] wd:book wd:musician [SEP] wdt:instance of wdt:author wdt:occupation",
        "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT DISTINCT ?var0  WHERE { ?var0 wdt:occupation wd:musician . ?var1 wdt:instance of wd:book ; wdt:author ?var0 . } GROUP BY ?var0 ORDER BY DESC(COUNT(?var1)) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which films starring Clint Eastwood did he direct himself? [SEP] wd:Clint Eastwood [SEP] wdt:cast member wdt:director",
        "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT DISTINCT ?var0  WHERE { ?var0 wdt:director wd:Clint Eastwood ; wdt:cast member wd:Clint Eastwood . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which software has been developed by organizations founded in California? [SEP] wd:software category wd:business wd:California [SEP] wdt:location of formation wdt:instance of wdt:subclass of wdt:developer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:developer ?var2 ; wdt:instance of* wd:software category . ?var0 wdt:subclass of* wd:business . ?var2 wdt:instance of ?var0 ; wdt:location of formation wd:California . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many airlines are members of the Star Alliance? [SEP] wd:Star Alliance [SEP] wdt:airline alliance",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) as ?var1) WHERE { ?var0 wdt:airline alliance wd:Star Alliance . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all actors called Baldwin. [SEP] wd:actor [SEP] wdt:occupation",
        "output":"PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:occupation wd:actor ; rdfs:label ?var0 . FILTER(CONTAINS(?var0, \"Baldwin\"))}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who wrote The Hunger Games? [SEP] wd:The Hunger Games [SEP] wdt:author",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:The Hunger Games wdt:author ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"For which label did Elvis record his first album? [SEP] wd:Elvis Presley's albums in chronological order [SEP] wdt:record label wdt:publication date wdt:has part(s)",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Elvis Presley's albums in chronological order wdt:has part(s) ?var2 . ?var2 wdt:publication date ?var1 . ?var2 wdt:record label ?var0 . } ORDER BY ?var1 LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is Christian Bale starring in Batman Begins? [SEP] wd:Christian Bale wd:Batman Begins [SEP] wdt:cast member",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Batman Begins wdt:cast member wd:Christian Bale }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Where is the residence of the prime minister of Spain? [SEP] wd:Prime Minister of Spain [SEP] wdt:official residence",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Prime Minister of Spain wdt:official residence ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which actor was casted in the most movies? [SEP] wd:actor [SEP] wdt:cast member wdt:occupation",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:occupation wd:actor . ?var0 wdt:cast member ?var1 . } GROUP BY ?var1 ORDER BY DESC(COUNT(DISTINCT(?var0))) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which countries have more than two official languages? [SEP] wd:country [SEP] wdt:instance of wdt:official language",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of wd:country . ?var1 wdt:official language ?var0 . } GROUP BY ?var1 HAVING(COUNT(?var0)>2)",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Show me all songs from Bruce Springsteen released between 1980 and 1990. [SEP] wd:Bruce Springsteen wd:song [SEP] wdt:instance of wdt:publication date wdt:performer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var2 WHERE { ?var2 wdt:instance of wd:song ; wdt:publication date ?var0 ; wdt:performer wd:Bruce Springsteen . BIND(YEAR(?var0) as ?var1) . FILTER(?var1 >= 1980 && ?var1 <= 1990) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which television shows were created by John Cleese? [SEP] wd:television series wd:John Cleese [SEP] wdt:instance of wdt:has part(s) wdt:creator",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:television series  . { ?var0 wdt:creator wd:John Cleese . } UNION { ?var0 wdt:creator\/wdt:has part(s) wd:John Cleese . }  }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"When did Latvia join the EU? [SEP] wd:European Union wd:Latvia [SEP] ",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { wd:Latvia <http:\/\/www.wikidata.org\/prop\/P463> ?var0 . ?var0 <http:\/\/www.wikidata.org\/prop\/statement\/P463> wd:European Union . ?var0 <http:\/\/www.wikidata.org\/prop\/qualifier\/P580> ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which soccer players were born on Malta? [SEP] wd:Malta wd:association football player [SEP] wdt:country wdt:place of birth wdt:occupation",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:occupation wd:association football player ; wdt:place of birth ?var0 . ?var0 wdt:country wd:Malta . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many politicians graduated from Columbia University? [SEP] wd:Columbia University wd:politician [SEP] wdt:occupation wdt:educated at",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 wdt:occupation wd:politician ; wdt:educated at wd:Columbia University . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me the birthdays of all actors of the television show Charmed. [SEP] wd:Charmed [SEP] wdt:date of birth wdt:cast member",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Charmed wdt:cast member\/wdt:date of birth ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which telecommunications organizations are located in Belgium? [SEP] wd:Belgium wd:telecommunications wd:organization [SEP] wdt:instance of wdt:subclass of wdt:country wdt:industry",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { { ?var0 wdt:instance of wd:organization } UNION { ?var0 wdt:instance of\/(wdt:subclass of*) wd:organization } . ?var0 wdt:industry wd:telecommunications .  ?var0 wdt:country wd:Belgium . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me a list of all lakes in Denmark. [SEP] wd:lake wd:Denmark [SEP] wdt:instance of wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:lake ; wdt:country wd:Denmark . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many children does Eddie Murphy have? [SEP] wd:Eddie Murphy [SEP] wdt:child",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { wd:Eddie Murphy wdt:child ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Show me all English Gothic buildings in Kent. [SEP] wd:Gothic architecture wd:Kent [SEP] wdt:historic county wdt:architectural style wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var1 WHERE { ?var0 wdt:subclass of* wd:Gothic architecture . ?var1 wdt:architectural style ?var0 ; wdt:historic county wd:Kent . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which countries can you pay using the West African CFA franc? [SEP] wd:West African CFA franc [SEP] wdt:currency",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:currency wd:West African CFA franc . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which holidays are celebrated around the world? [SEP] wd:holiday [SEP] wdt:instance of wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var0 wdt:subclass of* wd:holiday . ?var1 wdt:instance of ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    }
]