[
    {
        "input":"What is the official language of Suriname? [SEP] wd:Suriname [SEP] wdt:official language",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Suriname wdt:official language ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which city did Nikos Kazantzakis die? [SEP] wd:Nikos Kazantzakis [SEP] wdt:place of death",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Nikos Kazantzakis wdt:place of death ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is in a chocolate chip cookie? [SEP] wd:chocolate chip cookie [SEP] wdt:has part(s)",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:chocolate chip cookie wdt:has part(s) ?var0}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which country is the Limerick Lake? [SEP] wd:Limerick Lake [SEP] wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Limerick Lake wdt:country ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all members of Prodigy. [SEP] wd:The Prodigy [SEP] wdt:member of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:member of wd:The Prodigy . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which time zone is Rome? [SEP] wd:Rome [SEP] wdt:located in time zone",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Rome wdt:located in time zone ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who are the writers of the Wall album of Pink Floyd? [SEP] wd:The Wall [SEP] wdt:producer wdt:tracklist",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { wd:The Wall wdt:tracklist ?var0 . ?var0 wdt:producer ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the mayor of Rotterdam? [SEP] wd:Rotterdam [SEP] wdt:head of government",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Rotterdam wdt:head of government ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the largest city in Australia? [SEP] wd:Australia wd:city [SEP] wdt:instance of wdt:population wdt:subclass of wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of\/wdt:subclass of* wd:city ; wdt:country wd:Australia ; wdt:population ?var0 . } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who was married to president Chirac? [SEP] wd:Jacques Chirac [SEP] wdt:spouse",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Jacques Chirac wdt:spouse ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What form of government is found in South Africa? [SEP] wd:South Africa [SEP] wdt:basic form of government",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:South Africa wdt:basic form of government ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How high is the Yokohama Marine Tower? [SEP] wd:Yokohama Marine Tower [SEP] wdt:height",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Yokohama Marine Tower wdt:height ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which holidays are celebrated around the world? [SEP] wd:holiday [SEP] wdt:instance of wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT ?var0 WHERE { ?var0 wdt:instance of\/wdt:subclass of* wd:holiday . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the tallest basketball player? [SEP] wd:basketball player [SEP] wdt:occupation wdt:height",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:occupation wd:basketball player ; wdt:height ?var0 . } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many languages are spoken in Turkmenistan? [SEP] wd:Turkmenistan [SEP] wdt:language used",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) as ?var1) WHERE { wd:Turkmenistan wdt:language used ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Did Che Guevara have children? [SEP] wd:Che Guevara [SEP] wdt:child",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Che Guevara wdt:child ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Did Kaurismki ever win the Grand Prix at Cannes? [SEP] wd:Aki Kaurismki wd:Cannes Film Festival Grand Prix [SEP] wdt:award received",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Aki Kaurismki wdt:award received  wd:Cannes Film Festival Grand Prix . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"To which party does the mayor of Paris belong? [SEP] wd:Paris [SEP] wdt:head of government wdt:member of political party",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Paris wdt:head of government\/wdt:member of political party ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the Formula 1 race driver with the most races? [SEP] wd:Formula One driver [SEP] wdt:number of matches played\/races\/starts wdt:occupation",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:Formula One driver ; wdt:number of matches played\/races\/starts ?var1 . } ORDER BY DESC(?var1) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What country is Sitecore from? [SEP] wd:Sitecore [SEP] wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Sitecore wdt:country ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me the birth place of Frank Sinatra. [SEP] wd:Frank Sinatra [SEP] wdt:place of birth",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Frank Sinatra wdt:place of birth ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is Christian Bale starring in Velvet Goldmine? [SEP] wd:Christian Bale wd:Velvet Goldmine [SEP] wdt:cast member",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Velvet Goldmine wdt:cast member wd:Christian Bale . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the son of Sonny and Cher? [SEP] wd:Cher wd:Sonny Bono [SEP] wdt:mother wdt:father",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:father wd:Sonny Bono . ?var0 wdt:mother wd:Cher . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the capital of Cameroon? [SEP] wd:Cameroon [SEP] wdt:capital",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Cameroon wdt:capital ?var0}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Was Natalie Portman born in the United States? [SEP] wd:United States wd:Natalie Portman [SEP] wdt:country wdt:place of birth",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Natalie Portman wdt:place of birth ?var0 . ?var0 wdt:country wd:United States . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the oldest child of Meryl Streep? [SEP] wd:Meryl Streep [SEP] wdt:date of birth wdt:child",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { wd:Meryl Streep wdt:child ?var1 . ?var1 wdt:date of birth ?var0 . } ORDER BY ASC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which television shows were created by Walt Disney? [SEP] wd:Walt Disney wd:series of creative works [SEP] wdt:instance of wdt:subclass of wdt:creator",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of\/wdt:subclass of* wd:series of creative works ; wdt:creator wd:Walt Disney . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Was U.S. president Jackson involved in a war? [SEP] wd:Andrew Jackson [SEP] wdt:participated in conflict",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Andrew Jackson wdt:participated in conflict ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"When was the Titanic completed? [SEP] wd:Titanic [SEP] wdt:service entry",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Titanic wdt:service entry ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Did Tesla win a nobel prize in physics? [SEP] wd:Nikola Tesla wd:Nobel Prize in Physics [SEP] wdt:award received",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Nikola Tesla wdt:award received wd:Nobel Prize in Physics . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many states are in Mexico? [SEP] wd:state of Mexico [SEP] wdt:instance of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(?var1) AS ?var0) WHERE { ?var1 wdt:instance of wd:state of Mexico . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which scientist is known for the Manhattan Project and the Nobel Peace Prize? [SEP] wd:scientist wd:Manhattan Project wd:Nobel Peace Prize [SEP] wdt:participant in wdt:award received wdt:subclass of wdt:occupation",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:participant in wd:Manhattan Project . ?var0 wdt:subclass of* wd:scientist . ?var1 wdt:occupation ?var0 . ?var1 wdt:award received wd:Nobel Peace Prize . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How much did the Lego Movie cost? [SEP] wd:The LEGO Movie [SEP] wdt:capital cost",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:The LEGO Movie wdt:capital cost ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who composed the music for Harold and Maude? [SEP] wd:Harold and Maude [SEP] wdt:composer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Harold and Maude wdt:composer ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"List all episodes of the first season of the HBO television series The Sopranos. [SEP] wd:The Sopranos, season 1 wd:television series episode [SEP] wdt:instance of wdt:part of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:television series episode . ?var0 wdt:part of wd:The Sopranos, season 1 } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which city has the least inhabitants? [SEP] wd:city [SEP] wdt:instance of wdt:population",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of wd:city ; wdt:population ?var0 . } ORDER BY ?var0 LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Where is Syngman Rhee buried? [SEP] wd:Syngman Rhee [SEP] wdt:place of burial",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Syngman Rhee wdt:place of burial ?var0  . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Does Neymar play for Real Madrid? [SEP] wd:Real Madrid CF wd:Neymar [SEP] wdt:member of sports team",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE {  wd:Neymar wdt:member of sports team wd:Real Madrid CF}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Do Prince Harry and Prince William have the same parents? [SEP] wd:William, Prince of Wales wd:Prince Harry, Duke of Sussex [SEP] wdt:mother wdt:father",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Prince Harry, Duke of Sussex wdt:father ?var1 ; wdt:mother ?var0 . wd:William, Prince of Wales wdt:father ?var1 ; wdt:mother ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who was the doctoral supervisor of Albert Einstein? [SEP] wd:Albert Einstein [SEP] wdt:doctoral advisor",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Albert Einstein wdt:doctoral advisor ?var0}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Does Breaking Bad have more episodes than Game of Thrones? [SEP] wd:Game of Thrones wd:Breaking Bad [SEP] wdt:number of episodes",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Breaking Bad wdt:number of episodes ?var1 . wd:Game of Thrones wdt:number of episodes ?var0 . FILTER(?var1 > ?var0) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who was Vincent van Gogh inspired by? [SEP] wd:Vincent van Gogh [SEP] wdt:influenced by",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Vincent van Gogh wdt:influenced by ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which building after the Burj Khalifa has the most floors? [SEP] wd:Burj Khalifa [SEP] wdt:floors above ground",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var2 WHERE { wd:Burj Khalifa wdt:floors above ground ?var1 . ?var2 wdt:floors above ground ?var0 . FILTER (?var0 > ?var1) } ORDER BY ?var0 LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How much did Pulp Fiction cost? [SEP] wd:Pulp Fiction [SEP] wdt:capital cost",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Pulp Fiction wdt:capital cost ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is proinsulin a protein? [SEP] wd:protein wd:proinsulin [SEP] wdt:instance of wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:proinsulin wdt:instance of\/wdt:subclass of* wd:protein . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Do Urdu and Persian have a common root? [SEP] wd:Persian wd:Urdu [SEP] wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Urdu wdt:subclass of ?var0 . wd:Persian wdt:subclass of ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is starring in Spanish movies produced by Benicio del Toro? [SEP] wd:Spain wd:Benicio del Toro wd:film [SEP] wdt:country of origin wdt:instance of wdt:cast member wdt:producer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var0 wdt:instance of wd:film ; wdt:producer wd:Benicio del Toro ; wdt:country of origin wd:Spain ; wdt:cast member ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is Lake Baikal bigger than the Great Bear Lake? [SEP] wd:Lake Baikal wd:Great Bear Lake [SEP] wdt:area",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Lake Baikal wdt:area ?var1 . wd:Great Bear Lake wdt:area ?var0 . FILTER(?var1 > ?var0) }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Show me all books in Asimov's Foundation series. [SEP] wd:Foundation series [SEP] wdt:has part(s)",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Foundation series wdt:has part(s) ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Where was Bach born? [SEP] wd:Johann Sebastian Bach [SEP] wdt:place of birth",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Johann Sebastian Bach wdt:place of birth ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which city has the oldest running metro? [SEP] wd:rapid transit [SEP] wdt:instance of wdt:located in the administrative territorial entity wdt:inception",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var2 WHERE { ?var1 wdt:instance of wd:rapid transit ; wdt:inception ?var0 ; wdt:located in the administrative territorial entity ?var2 . } ORDER BY ?var0 LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who designed the Brooklyn Bridge? [SEP] wd:Brooklyn Bridge [SEP] wdt:designed by",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Brooklyn Bridge wdt:designed by ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many people live in Eurasia? [SEP] wd:Eurasia [SEP] wdt:population",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Eurasia wdt:population ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the total population of Melbourne, Florida? [SEP] wd:Melbourne [SEP] wdt:population",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Melbourne wdt:population ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What country is Mount Everest in? [SEP] wd:Mount Everest [SEP] wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Mount Everest wdt:country ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"To which artistic movement did the painter of The Three Dancers belong? [SEP] wd:The Three Dancers [SEP] wdt:movement wdt:creator",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { wd:The Three Dancers wdt:creator ?var0 . ?var0 wdt:movement ?var1 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"When did Operation Overlord commence? [SEP] wd:Operation Overlord [SEP] wdt:start time",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Operation Overlord wdt:start time ?var0  . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the bridge with the longest span? [SEP] wd:kilometre wd:mile wd:foot wd:bridge wd:metre [SEP] wdt:instance of wdt:subclass of",
        "output":"PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var7 WHERE { ?var7 wdt:instance of\/wdt:subclass of* wd:bridge ; p:P2787 ?var1 . ?var1 psv:P2787 ?var5 . ?var5 wikibase:quantityAmount ?var8 . ?var5 wikibase:quantityUnit ?var6 . BIND(IF(?var6 = wd:metre, ?var8, IF(?var6 = wd:foot,?var4.3048, IF(?var6 = wd:mile,?var3.34,IF(?var6 = wd:kilometre,?var2, ?var8)))) AS ?var0) } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is there a video game called Battle Chess? [SEP] wd:video game [SEP] wdt:instance of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> prefix rdfs:   <http:\/\/www.w3.org\/2000\/01\/rdf-schema#>  ASK WHERE { ?var0 wdt:instance of wd:video game . ?var0 rdfs:label \"Battle Chess\"@en }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who was buried in the Great Pyramid of Giza? [SEP] wd:Pyramid G1-a [SEP] wdt:place of burial",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:place of burial wd:Pyramid G1-a . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Did Socrates influence Aristotle? [SEP] wd:Socrates wd:Aristotle [SEP] wdt:influenced by",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Aristotle wdt:influenced by wd:Socrates . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many children did Benjamin Franklin have? [SEP] wd:Benjamin Franklin [SEP] wdt:child",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) as ?var1) WHERE { wd:Benjamin Franklin wdt:child ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How tall is Michael Jordan? [SEP] wd:Michael Jordan [SEP] wdt:height",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Michael Jordan wdt:height ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which UK city are the headquarters of the MI6? [SEP] wd:Secret Intelligence Service wd:city [SEP] wdt:headquarters location wdt:instance of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Secret Intelligence Service wdt:headquarters location ?var0 . ?var0  wdt:instance of  wd:city . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who created Family Guy? [SEP] wd:Family Guy [SEP] wdt:creator",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Family Guy wdt:creator ?var0}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me the grandchildren of Elvis Presley. [SEP] wd:Elvis Presley [SEP] wdt:child",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 WHERE { wd:Elvis Presley  wdt:child  ?var1 . ?var1  wdt:child ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"When did the Ming dynasty dissolve? [SEP] wd:Ming dynasty [SEP] wdt:dissolved, abolished or demolished date",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Ming dynasty wdt:dissolved, abolished or demolished date ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    }
]