[
    {
        "input":"In which military conflicts did Lawrence of Arabia participate? [SEP] wd:T. E. Lawrence [SEP] wdt:participated in conflict",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 WHERE { wd:T. E. Lawrence  wdt:participated in conflict  ?var0 .  } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the timezone in San Pedro de Atacama? [SEP] wd:San Pedro de Atacama [SEP] wdt:located in time zone",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 WHERE { wd:San Pedro de Atacama  wdt:located in time zone  ?var0 .  } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What did Bruce Carver die from? [SEP] wd:Bruce Carver [SEP] wdt:cause of death",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Bruce Carver  wdt:cause of death  ?var0 .  }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Does Abraham Lincoln's death place have a website? [SEP] wd:Abraham Lincoln [SEP] wdt:official website wdt:place of death",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Abraham Lincoln  wdt:place of death  ?var1 . ?var1  wdt:official website  ?var0 .  }  ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Did Elvis Presley have children? [SEP] wd:Elvis Presley [SEP] wdt:child",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Elvis Presley wdt:child ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is Michelle Obama the wife of Barack Obama? [SEP] wd:Michelle Obama wd:None [SEP] wdt:spouse",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:None  wdt:spouse  wd:Michelle Obama . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which city does Sylvester Stallone live? [SEP] wd:Sylvester Stallone wd:city [SEP] wdt:instance of wdt:residence",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Sylvester Stallone wdt:residence ?var0 . ?var0 wdt:instance of wd:city . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which books by Kerouac were published by Viking Press? [SEP] wd:Jack Kerouac wd:written work wd:Viking Press [SEP] wdt:instance of wdt:publisher wdt:author",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 WHERE { ?var0  wdt:publisher  wd:Viking Press . ?var0  wdt:instance of  wd:written work . ?var0  wdt:author  wd:Jack Kerouac . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who wrote the song Hotel California? [SEP] wd:Hotel California [SEP] wdt:composer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Hotel California wdt:composer ?var0}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the capital of Canada? [SEP] wd:Canada [SEP] wdt:capital",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Canada  wdt:capital  ?var0 .  }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the mayor of Tel Aviv? [SEP] wd:Tel Aviv [SEP] wdt:head of government",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Tel Aviv wdt:head of government ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What form of government does Russia have? [SEP] wd:Russia [SEP] ",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Russia <http:\/\/www.wikidata.org\/prop\/P122> ?var2 . ?var2 <http:\/\/www.wikidata.org\/prop\/statement\/P122> ?var0 . FILTER NOT EXISTS { ?var2 <http:\/\/www.wikidata.org\/prop\/qualifier\/P582> ?var1 }} ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Show me the book that Muhammad Ali wrote. [SEP] wd:book wd:Muhammad Ali [SEP] wdt:instance of wdt:author",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:book . ?var0 wdt:author wd:Muhammad Ali . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who was the first to climb Mount Everest? [SEP] wd:Mount Everest wd:first ascent [SEP] ",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var1 WHERE { ?var0 ps:P793   wd:first ascent . ?var0 pq:P642 wd:Mount Everest . ?var1 p:P793 ?var0   . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"How many languages are spoken in Colombia? [SEP] wd:language wd:Colombia [SEP] wdt:instance of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT (COUNT(?var1) as ?var2) WHERE { ?var1  ?var0  wd:Colombia . ?var1  wdt:instance of  wd:language .  }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the currency of the Czech Republic? [SEP] wd:Czech Republic [SEP] wdt:currency",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Czech Republic wdt:currency ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"When did Boris Becker end his active career? [SEP] wd:Boris Becker [SEP] ",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Boris Becker <http:\/\/www.wikidata.org\/prop\/P106>\/<http:\/\/www.wikidata.org\/prop\/qualifier\/P582> ?var0 }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which movies starring Mickey Rourke were directed by Guy Ritchie? [SEP] wd:Guy Ritchie wd:Mickey Rourke wd:film [SEP] wdt:instance of wdt:cast member wdt:director",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0  wdt:cast member  wd:Mickey Rourke .  ?var0  wdt:director  wd:Guy Ritchie . ?var0  wdt:instance of  wd:film . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which films did Julia Roberts as well as Richard Gere play? [SEP] wd:Julia Roberts wd:Richard Gere wd:film [SEP] wdt:instance of wdt:cast member",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:film . ?var0 wdt:cast member wd:Richard Gere . ?var0 wdt:cast member wd:Julia Roberts . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Show me Hemingway's autobiography. [SEP] wd:Ernest Hemingway wd:autobiography [SEP] wdt:author wdt:genre",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:author wd:Ernest Hemingway . ?var0 wdt:genre wd:autobiography . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What are the five boroughs of New York? [SEP] wd:borough of New York City [SEP] wdt:instance of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:instance of wd:borough of New York City . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all Canadian Grunge record labels. [SEP] wd:grunge wd:Canada wd:record label [SEP] wdt:instance of wdt:genre wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT ?var0 WHERE { ?var0  wdt:genre  wd:grunge . ?var0  wdt:instance of  wd:record label . ?var0  wdt:country wd:Canada . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which country does the Ganges start? [SEP] wd:Ganges [SEP] wdt:origin of the watercourse wdt:country",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT ?var0 WHERE { wd:Ganges  wdt:origin of the watercourse  ?var1 . ?var1  wdt:country  ?var0 .  } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the founder of Penguin Books? [SEP] wd:Penguin Books [SEP] wdt:founded by",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Penguin Books  wdt:founded by  ?var0 .  }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who wrote the Game of Thrones theme? [SEP] wd:Game of Thrones [SEP] wdt:composer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Game of Thrones wdt:composer ?var0 . }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who is the president of Eritrea? [SEP] wd:Eritrea [SEP] wdt:head of state",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Eritrea wdt:head of state ?var0}",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which city did John F. Kennedy die? [SEP] wd:John F. Kennedy wd:city [SEP] wdt:place of death wdt:instance of wdt:located in the administrative territorial entity",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:John F. Kennedy wdt:place of death\/wdt:located in the administrative territorial entity ?var0 . ?var0 wdt:instance of wd:city  .  } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What is the highest mountain in Australia? [SEP] wd:Australian continent wd:mountain [SEP] wdt:instance of wdt:continent wdt:elevation above sea level",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of wd:mountain . ?var1 wdt:continent wd:Australian continent . ?var1 wdt:elevation above sea level ?var0. } ORDER BY DESC(?var0) LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me the currency of China. [SEP] wd:People's Republic of China [SEP] wdt:currency",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE {   wd:People's Republic of China  wdt:currency  ?var0 .  } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all Swedish oceanographers. [SEP] wd:Sweden wd:oceanographer [SEP] wdt:country of citizenship wdt:occupation",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE {   ?var0  wdt:country of citizenship  wd:Sweden .   ?var0  wdt:occupation  wd:oceanographer .  }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which city are the headquarters of the United Nations? [SEP] wd:city wd:Headquarters of the United Nations [SEP] wdt:instance of wdt:located in the administrative territorial entity wdt:subclass of",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Headquarters of the United Nations wdt:located in the administrative territorial entity ?var0 . { ?var0 wdt:instance of wd:city . } UNION {?var0 wdt:instance of\/wdt:subclass of wd:city . } }",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Is Rita Wilson the wife of Tom Hanks? [SEP] wd:Tom Hanks wd:Rita Wilson [SEP] wdt:spouse",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Tom Hanks  wdt:spouse  wd:Rita Wilson . } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"In which countries do people speak Japanese? [SEP] wd:country wd:Japanese [SEP] wdt:instance of wdt:official language",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:country . ?var0 wdt:official language wd:Japanese . } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which of Tim Burton's films had the highest budget? [SEP] wd:Tim Burton wd:film [SEP] wdt:instance of wdt:budget",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var1 WHERE {    ?var1  ?var0  wd:Tim Burton . ?var1  wdt:instance of  wd:film .  ?var1  wdt:budget ?var2 } order by ?var2 limit 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Which museum in New York has the most visitors? [SEP] wd:museum wd:New York City [SEP] wdt:instance of wdt:headquarters location wdt:visitors per year",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT ?var0 WHERE { ?var0  wdt:headquarters location  wd:New York City . ?var0  wdt:instance of  wd:museum . ?var0  wdt:visitors per year ?var1 } order by ?var1 limit 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What was the first Queen album? [SEP] wd:album wd:Queen [SEP] wdt:instance of wdt:publication date wdt:performer",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var1 WHERE { ?var1 wdt:instance of wd:album . ?var1 wdt:performer wd:Queen . ?var1 wdt:publication date ?var0 } ORDER BY ?var0 LIMIT 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"What was the last movie with Alec Guinness? [SEP] wd:Alec Guinness wd:film [SEP] wdt:instance of wdt:publication date wdt:cast member",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0  wdt:instance of  wd:film . ?var0  wdt:cast member  wd:Alec Guinness . ?var0 wdt:publication date ?var1 . }  order by DESC(?var1)  limit 1",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Give me all actors starring in Last Action Hero. [SEP] wd:Last Action Hero [SEP] wdt:cast member",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE {   wd:Last Action Hero  wdt:cast member  ?var0 .  } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    },
    {
        "input":"Who discovered Pluto? [SEP] wd:human wd:Pluto [SEP] wdt:instance of wdt:discoverer or inventor",
        "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE {   wd:Pluto  wdt:discoverer or inventor  ?var0 .   ?var0  wdt:instance of  wd:human .  } ",
        "instruction":"Write a SPARQL query to answer the following question using the Wikidata knowledge base:"
    }
]