[
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Rolls-Royce wdt:owned by ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:owned by wd:Rolls-Royce . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:museum ; wdt:located in the administrative territorial entity wd:Paris . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Paris wdt:instance of wd:museum ; wdt:located in the administrative territorial entity ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:John F. Kennedy wdt:place of death ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:place of death wd:John F. Kennedy . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:position held wd:Federal Chancellor of Germany . } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Federal Chancellor of Germany wdt:position held ?var0 . } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { VALUES ?var1 { wd:beer wd:beer brand } ?var0 wdt:instance of ?var1 ; wdt:country wd:Ireland . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { VALUES ?var1 { wd:beer wd:beer brand } ?var0 wdt:instance of ?var1 ; wdt:country wd:Ireland . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:film actor . { ?var0 wdt:place of birth wd:Germany . } UNION { ?var0 wdt:place of birth\/wdt:country wd:Germany . } }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:film actor wdt:occupation ?var0 . { ?var0 wdt:place of birth wd:Germany . } UNION { ?var0 wdt:place of birth\/wdt:country wd:Germany . } }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:instance of wd:film . ?var1 wdt:producer ?var0 . } GROUP BY ?var0 ORDER BY DESC(COUNT(?var1)) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:instance of wd:film . ?var0 wdt:producer ?var1 . } GROUP BY ?var0 ORDER BY DESC(COUNT(?var1)) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Google wdt:employees ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:employees wd:Google . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:actor ; wdt:place of birth wd:Berlin . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:actor wdt:occupation ?var0 ; wdt:place of birth wd:Berlin . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Goofy wdt:creator ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:creator wd:Goofy . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { { wd:Last Christmas wdt:part of ?var0 . } UNION { VALUES ?var1 { wd:album wd:studio album } ?var0 wdt:instance of|wdt:form of creative work ?var1 ; wdt:tracklist wd:Last Christmas . }}",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { { wd:Last Christmas wdt:part of ?var0 . } UNION { VALUES ?var1 { wd:album wd:studio album } wd:Last Christmas wdt:instance of|wdt:form of creative work ?var1 ; wdt:tracklist ?var0 . }}"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Alberta wdt:inception ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:inception wd:Alberta . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 wdt:part of wd:Soyuz programme }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { wd:Soyuz programme wdt:part of ?var0 }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var1 wdt:subclass of* wd:television program . ?var0 wdt:cast member wd:Neil Patrick Harris . ?var0 wdt:instance of ?var1 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var1 wdt:subclass of* wd:television program . wd:Neil Patrick Harris wdt:cast member ?var0 . ?var0 wdt:instance of ?var1 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Hells Angels wdt:inception ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:inception wd:Hells Angels . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Apple Inc. wdt:net profit ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:net profit wd:Apple Inc. . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:instance of wd:public holidays in Sweden . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:public holidays in Sweden wdt:instance of ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Juliana of the Netherlands wdt:place of burial ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:place of burial wd:Juliana of the Netherlands . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:musical ; wdt:composer wd:Leonard Bernstein . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Leonard Bernstein wdt:instance of wd:musical ; wdt:composer ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:business ; wdt:industry wd:marketing . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:business wdt:instance of ?var0 ; wdt:industry wd:marketing . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:John Lennon wdt:killed by ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:killed by wd:John Lennon . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:writer . ?var0 wdt:educated at\/wdt:located in the administrative territorial entity  wd:Istanbul . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:writer . wd:Istanbul wdt:educated at\/wdt:located in the administrative territorial entity  ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:musical group ; wdt:country of origin wd:Australia ; wdt:genre wd:metalcore . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:metalcore wdt:instance of wd:musical group ; wdt:country of origin wd:Australia ; wdt:genre ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:country . ?var0 wdt:currency wd:euro   . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:country . wd:euro wdt:currency ?var0   . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:subclass of wd:eating disorder . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:eating disorder wdt:subclass of ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Marc Chagall wdt:ethnic group wd:Jewish people . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Jewish people wdt:ethnic group wd:Marc Chagall . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT ?var0 WHERE { wd:Brazil men's national football team p:P1352 ?var1 . ?var1 pq:P459 wd:FIFA World Rankings ; ps:P1352 ?var0 . } ORDER BY DESC(?var0) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT ?var0 WHERE { ?var1 p:P1352 wd:Brazil men's national football team . ?var1 pq:P459 wd:FIFA World Rankings ; ps:P1352 ?var0 . } ORDER BY DESC(?var0) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 wdt:instance of wd:film ; wdt:cast member wd:Leonardo DiCaprio . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { wd:film wdt:instance of ?var0 ; wdt:cast member wd:Leonardo DiCaprio . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Margaret Thatcher wdt:occupation wd:chemist . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:chemist wdt:occupation wd:Margaret Thatcher . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Utah wdt:located in time zone ?var1 . ?var0 wdt:instance of wd:U.S. state ; wdt:located in time zone ?var1 . FILTER(?var0 != wd:Utah) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Utah wdt:located in time zone ?var1 . wd:U.S. state wdt:instance of ?var0 ; wdt:located in time zone ?var1 . FILTER(?var0 != wd:Utah) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:book . ?var0 wdt:author wd:Danielle Steel . } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:book . wd:Danielle Steel wdt:author ?var0 . } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:country . ?var0 wdt:official language ?var1 . } GROUP BY ?var0 ORDER BY DESC(COUNT(?var1)) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:country wdt:instance of ?var0 . ?var0 wdt:official language ?var1 . } GROUP BY ?var0 ORDER BY DESC(COUNT(?var1)) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Chewbacca wdt:performer ?var0 }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:performer wd:Chewbacca }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:library ; wdt:inception ?var1 . FILTER (YEAR(?var1) < 1400 ) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:library wdt:instance of ?var0 ; wdt:inception ?var1 . FILTER (YEAR(?var1) < 1400 ) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:programming language ; wdt:influenced by wd:None . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:None wdt:instance of wd:programming language ; wdt:influenced by ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Denali wdt:located in the administrative territorial entity ?var0}",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:located in the administrative territorial entity wd:Denali}"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:airline alliance wd:SkyTeam . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:SkyTeam wdt:airline alliance ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:politician ; wdt:religion or worldview wd:Methodism . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:politician wdt:occupation ?var0 ; wdt:religion or worldview wd:Methodism . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:The Fault in Our Stars wdt:author ?var1 . ?var0 wdt:author ?var1 . FILTER(?var0 != wd:The Fault in Our Stars) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:author wd:The Fault in Our Stars . ?var0 wdt:author ?var1 . FILTER(?var0 != wd:The Fault in Our Stars) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:mountain ; wdt:elevation above sea level ?var1 . } ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:instance of wd:mountain ; wdt:elevation above sea level ?var0 . } ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 (COUNT(?var1) as ?var2 ) WHERE { ?var0  wdt:occupation  wd:poet . ?var1  wdt:author  ?var0 . ?var1  wdt:instance of  wd:book .  } GROUP BY ?var0 ORDER BY DESC(COUNT(?var1)) OFFSET 0 LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 (COUNT(?var1) as ?var2 ) WHERE { ?var0  wdt:occupation  wd:poet . ?var1  wdt:author  ?var0 . wd:book  wdt:instance of  ?var1 .  } GROUP BY ?var0 ORDER BY DESC(COUNT(?var1)) OFFSET 0 LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:None wdt:influenced by ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:influenced by wd:None . }"
  },
  {
    "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT DISTINCT ?var0  WHERE { ?var0 wdt:occupation wd:musician . ?var1 wdt:instance of wd:book ; wdt:author ?var0 . } GROUP BY ?var0 ORDER BY DESC(COUNT(?var1)) LIMIT 1",
    "input":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT DISTINCT ?var0  WHERE { wd:musician wdt:occupation ?var0 . ?var1 wdt:instance of wd:book ; wdt:author ?var0 . } GROUP BY ?var0 ORDER BY DESC(COUNT(?var1)) LIMIT 1"
  },
  {
    "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT DISTINCT ?var0  WHERE { ?var0 wdt:director wd:Clint Eastwood ; wdt:cast member wd:Clint Eastwood . }",
    "input":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT DISTINCT ?var0  WHERE { wd:Clint Eastwood wdt:director ?var0 ; wdt:cast member wd:Clint Eastwood . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:developer ?var1 ; wdt:instance of* wd:software category . ?var2 wdt:subclass of* wd:business . ?var1 wdt:instance of ?var2 ; wdt:location of formation wd:California . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:developer ?var1 ; wdt:instance of* wd:software category . ?var2 wdt:subclass of* wd:business . ?var2 wdt:instance of ?var1 ; wdt:location of formation wd:California . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) as ?var1) WHERE { ?var0 wdt:airline alliance wd:Star Alliance . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) as ?var1) WHERE { wd:Star Alliance wdt:airline alliance ?var0 . }"
  },
  {
    "output":"PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:actor ; rdfs:label ?var1 . FILTER(CONTAINS(?var1, \"Baldwin\"))}",
    "input":"PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:actor wdt:occupation ?var0 ; rdfs:label ?var1 . FILTER(CONTAINS(?var1, \"Baldwin\"))}"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:The Hunger Games wdt:author ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:author wd:The Hunger Games . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Elvis Presley's albums in chronological order wdt:has part(s) ?var1 . ?var1 wdt:publication date ?var2 . ?var1 wdt:record label ?var0 . } ORDER BY ?var2 LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Elvis Presley's albums in chronological order wdt:has part(s) ?var1 . ?var2 wdt:publication date ?var1 . ?var1 wdt:record label ?var0 . } ORDER BY ?var2 LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Batman Begins wdt:cast member wd:Christian Bale }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Christian Bale wdt:cast member wd:Batman Begins }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Prime Minister of Spain wdt:official residence ?var0 }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:official residence wd:Prime Minister of Spain }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:actor . ?var1 wdt:cast member ?var0 . } GROUP BY ?var0 ORDER BY DESC(COUNT(DISTINCT(?var1))) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:actor . ?var0 wdt:cast member ?var1 . } GROUP BY ?var0 ORDER BY DESC(COUNT(DISTINCT(?var1))) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:country . ?var0 wdt:official language ?var1 . } GROUP BY ?var0 HAVING(COUNT(?var1)>2)",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:country wdt:instance of ?var0 . ?var0 wdt:official language ?var1 . } GROUP BY ?var0 HAVING(COUNT(?var1)>2)"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:song ; wdt:publication date ?var1 ; wdt:performer wd:Bruce Springsteen . BIND(YEAR(?var1) as ?var2) . FILTER(?var2 >= 1980 && ?var2 <= 1990) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Bruce Springsteen wdt:instance of wd:song ; wdt:publication date ?var1 ; wdt:performer ?var0 . BIND(YEAR(?var1) as ?var2) . FILTER(?var2 >= 1980 && ?var2 <= 1990) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:television series  . { ?var0 wdt:creator wd:John Cleese . } UNION { ?var0 wdt:creator\/wdt:has part(s) wd:John Cleese . }  }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:television series  . { ?var0 wdt:creator wd:John Cleese . } UNION { wd:John Cleese wdt:creator\/wdt:has part(s) ?var0 . }  }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Latvia <http:\/\/www.wikidata.org\/prop\/P463> ?var1 . ?var1 <http:\/\/www.wikidata.org\/prop\/statement\/P463> wd:European Union . ?var1 <http:\/\/www.wikidata.org\/prop\/qualifier\/P580> ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Latvia <http:\/\/www.wikidata.org\/prop\/P463> ?var1 . ?var1 <http:\/\/www.wikidata.org\/prop\/statement\/P463> wd:European Union . ?var0 <http:\/\/www.wikidata.org\/prop\/qualifier\/P580> ?var1 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:association football player ; wdt:place of birth ?var1 . ?var1 wdt:country wd:Malta . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:association football player ; wdt:place of birth ?var1 . wd:Malta wdt:country ?var1 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 wdt:occupation wd:politician ; wdt:educated at wd:Columbia University . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { wd:Columbia University wdt:occupation wd:politician ; wdt:educated at ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Charmed wdt:cast member\/wdt:date of birth ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:cast member\/wdt:date of birth wd:Charmed . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { { ?var0 wdt:instance of wd:organization } UNION { ?var0 wdt:instance of\/(wdt:subclass of*) wd:organization } . ?var0 wdt:industry wd:telecommunications .  ?var0 wdt:country wd:Belgium . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { { ?var0 wdt:instance of wd:organization } UNION { ?var0 wdt:instance of\/(wdt:subclass of*) wd:organization } . wd:Belgium wdt:industry wd:telecommunications .  ?var0 wdt:country ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:lake ; wdt:country wd:Denmark . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:lake wdt:instance of ?var0 ; wdt:country wd:Denmark . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { wd:Eddie Murphy wdt:child ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 wdt:child wd:Eddie Murphy . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var1 wdt:subclass of* wd:Gothic architecture . ?var0 wdt:architectural style ?var1 ; wdt:historic county wd:Kent . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Gothic architecture wdt:subclass of* ?var1 . ?var0 wdt:architectural style ?var1 ; wdt:historic county wd:Kent . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:currency wd:West African CFA franc . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:West African CFA franc wdt:currency ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:subclass of* wd:holiday . ?var0 wdt:instance of ?var1 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:holiday wdt:subclass of* ?var1 . ?var0 wdt:instance of ?var1 . }"
  }
]