[
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:instance of wd:board game . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:board game wdt:instance of ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Skype wdt:developer ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:developer wd:Skype . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:place of birth wd:Heraklion . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Heraklion wdt:place of birth ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Area 51 wdt:located in the administrative territorial entity ?var1 . ?var1 wdt:located in the administrative territorial entity ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:located in the administrative territorial entity wd:Area 51 . ?var1 wdt:located in the administrative territorial entity ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:New York City wdt:head of government ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:head of government wd:New York City . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Air China wdt:airline hub ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:airline hub wd:Air China . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:director wd:William Shatner ; wdt:cast member wd:William Shatner   . ?var1 wdt:cast member ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:director wd:William Shatner ; wdt:cast member wd:William Shatner   . ?var0 wdt:cast member ?var1 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Philippines wdt:official language ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:official language wd:Philippines . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:subclass of* wd:film . ?var0 wdt:instance of ?var1 ; wdt:country of origin wd:Denmark . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:film wdt:subclass of* ?var1 . ?var0 wdt:instance of ?var1 ; wdt:country of origin wd:Denmark . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:subclass of* wd:film . ?var0 wdt:instance of ?var1 ; wdt:cast member wd:Brad Pitt ; wdt:director wd:Guy Ritchie . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:film wdt:subclass of* ?var1 . ?var0 wdt:instance of ?var1 ; wdt:cast member wd:Brad Pitt ; wdt:director wd:Guy Ritchie . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Bruce Lee wdt:child ?var1 . ?var1 wdt:child ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:child wd:Bruce Lee . ?var1 wdt:child ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:subclass of* wd:weapon . wd:Uzi wdt:designed by ?var2 . ?var0 wdt:subclass of ?var1 ; wdt:designed by ?var2 . FILTER (?var0 != wd:Uzi) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:weapon wdt:subclass of* ?var1 . wd:Uzi wdt:designed by ?var2 . ?var0 wdt:subclass of ?var1 ; wdt:designed by ?var2 . FILTER (?var0 != wd:Uzi) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Universal Pictures wdt:owned by ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:owned by wd:Universal Pictures . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:U.S. state ; wdt:area ?var1 ; wdt:population ?var2 . BIND((?var2\/?var1) AS ?var4) . } ORDER BY DESC(?var4) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var2 wdt:instance of wd:U.S. state ; wdt:area ?var1 ; wdt:population ?var0 . BIND((?var2\/?var1) AS ?var4) . } ORDER BY DESC(?var4) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:monarch ; wdt:spouse ?var1 . ?var1 wdt:country of citizenship wd:Germany . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:monarch ; wdt:spouse ?var1 . wd:Germany wdt:country of citizenship ?var1 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:subclass of* wd:organization . ?var0 wdt:instance of ?var1 . ?var0 wdt:inception ?var2 . FILTER CONTAINS(STR(?var2), \"1950\") }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:organization wdt:subclass of* ?var1 . ?var0 wdt:instance of ?var1 . ?var0 wdt:inception ?var2 . FILTER CONTAINS(STR(?var2), \"1950\") }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Captain America wdt:creator ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:creator wd:Captain America . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Apollo 14 wdt:crew member ?var0 }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:crew member wd:Apollo 14 }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:The Pillars of the Earth wdt:author ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:author wd:The Pillars of the Earth . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:U.S. state ; wdt:area ?var1 ; wdt:population ?var2 . BIND((?var2\/?var1) AS ?var4) . } ORDER BY DESC(?var4) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:instance of wd:U.S. state ; wdt:area ?var0 ; wdt:population ?var2 . BIND((?var2\/?var1) AS ?var4) . } ORDER BY DESC(?var4) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:start point wd:Baikonur Cosmodrome }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Baikonur Cosmodrome wdt:start point ?var0 }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:conductor ; wdt:instrument wd:trumpet . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:conductor wdt:occupation ?var0 ; wdt:instrument wd:trumpet . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Utah wdt:located in time zone ?var1 . ?var0 wdt:instance of wd:U.S. state ; wdt:located in time zone ?var1 . FILTER(?var0 != wd:Utah) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Utah wdt:located in time zone ?var1 . ?var1 wdt:instance of wd:U.S. state ; wdt:located in time zone ?var0 . FILTER(?var0 != wd:Utah) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Ingrid Bergman wdt:child ?var1 . ?var1 wdt:spouse ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Ingrid Bergman wdt:child ?var1 . ?var0 wdt:spouse ?var1 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:instance of wd:museum . ?var0 wdt:location wd:London . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:museum wdt:instance of ?var0 . ?var0 wdt:location wd:London . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:member of sports team wd:Atlanta Falcons ; wdt:height ?var1 . } ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:member of sports team wd:Atlanta Falcons ; wdt:height ?var0 . } ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:occupation wd:writer . ?var0 wdt:award received wd:Nobel Prize in Literature . } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:writer wdt:occupation ?var0 . ?var0 wdt:award received wd:Nobel Prize in Literature . } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:basketball player . ?var0 wdt:height ?var1 .  FILTER(?var1 > 200)}",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:basketball player wdt:occupation ?var0 . ?var0 wdt:height ?var1 .  FILTER(?var1 > 200)}"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Statue of Liberty wdt:inception ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:inception wd:Statue of Liberty . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Illinois wdt:shares border with ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:shares border with wd:Illinois . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Minecraft wdt:developer ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:developer wd:Minecraft . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Hillel Slovak wdt:place of death ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:place of death wd:Hillel Slovak . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:cast member wd:None . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:None wdt:cast member ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:swimmer ; wdt:place of birth wd:Moscow . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Moscow wdt:occupation wd:swimmer ; wdt:place of birth ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0  wdt:occupation wd:astronaut . { ?var0 wdt:country of citizenship wd:Soviet Union } UNION { ?var0 wdt:country of citizenship wd:Russia } }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:astronaut  wdt:occupation ?var0 . { ?var0 wdt:country of citizenship wd:Soviet Union } UNION { ?var0 wdt:country of citizenship wd:Russia } }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:nonprofit organization . { ?var0 wdt:headquarters location wd:Switzerland . } UNION { ?var0 wdt:headquarters location ?var1 . ?var1 wdt:instance of wd:municipality of Switzerland } }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:nonprofit organization . { ?var0 wdt:headquarters location wd:Switzerland . } UNION { ?var0 wdt:headquarters location ?var1 . wd:municipality of Switzerland wdt:instance of ?var1 } }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:position held\/wdt:subclass of wd:president . ?var0 wdt:date of birth ?var1 . FILTER(year(?var1)=1945) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:president wdt:position held\/wdt:subclass of ?var0 . ?var0 wdt:date of birth ?var1 . FILTER(year(?var1)=1945) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Lou Reed wdt:genre ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:genre wd:Lou Reed . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Boston Red Sox wdt:home venue ?var0 }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:home venue wd:Boston Red Sox }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:association football club ; wdt:league or competition wd:None . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:association football club wdt:instance of ?var0 ; wdt:league or competition wd:None . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:bridge ; wdt:crosses wd:Seine . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:bridge wdt:instance of ?var0 ; wdt:crosses wd:Seine . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(?var0) as ?var1) WHERE { ?var0 wdt:producer wd:Hal Roach . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(?var0) as ?var1) WHERE { wd:Hal Roach wdt:producer ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:subclass of* wd:film . ?var0 wdt:instance of ?var1 ; wdt:country of origin wd:Denmark . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:subclass of* wd:film . ?var1 wdt:instance of ?var0 ; wdt:country of origin wd:Denmark . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var1 wdt:cause of death ?var0 . } GROUP BY ?var0 ORDER BY DESC(COUNT(DISTINCT ?var1)) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:cause of death ?var1 . } GROUP BY ?var0 ORDER BY DESC(COUNT(DISTINCT ?var1)) LIMIT 1"
  },
  {
    "output":"PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:occupation wd:basketball player ; wdt:date of birth ?var1 ; wdt:award received ?var2 . ?var2 rdfs:label ?var2Label FILTER (CONTAINS(STR(?var2Label), \"MVP\") || CONTAINS(STR(?var2Label), \"Most Valuable Player\")) . FILTER (LANGMATCHES(LANG(?var2Label), \"EN\" ) ) } ORDER BY DESC(?var1) LIMIT 4",
    "input":"PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:occupation wd:basketball player ; wdt:date of birth ?var1 ; wdt:award received ?var2 . ?var2 rdfs:label ?var2Label FILTER (CONTAINS(STR(?var2Label), \"MVP\") || CONTAINS(STR(?var2Label), \"Most Valuable Player\")) . FILTER (LANGMATCHES(LANG(?var2Label), \"EN\" ) ) } ORDER BY DESC(?var1) LIMIT 4"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:subclass of* wd:business . ?var0 wdt:instance of ?var1 ; wdt:headquarters location wd:Munich . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:business wdt:subclass of* ?var1 . ?var0 wdt:instance of ?var1 ; wdt:headquarters location wd:Munich . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Himalayas wdt:country ?var1 . ?var1 wdt:capital ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Himalayas wdt:country ?var1 . ?var0 wdt:capital ?var1 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) as ?var1) WHERE {  ?var0 wdt:director wd:Park Chan-wook . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) as ?var1) WHERE {  wd:Park Chan-wook wdt:director ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:river . ?var1 wdt:instance of wd:lake ; wdt:country wd:183 . ?var0 wdt:inflows ?var1 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:river . ?var1 wdt:instance of wd:lake ; wdt:country wd:183 . ?var1 wdt:inflows ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) AS ?var0) WHERE { ?var0 wdt:instance of wd:airline }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) AS ?var0) WHERE { wd:airline wdt:instance of ?var0 }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:island ; wdt:country wd:Japan . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Japan wdt:instance of wd:island ; wdt:country ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Maribor wdt:population ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:population wd:Maribor . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:subclass of* wd:business . ?var0 wdt:instance of ?var1 ; wdt:employees ?var2 . FILTER(?var2 > 1000000) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:subclass of* wd:business . ?var2 wdt:instance of ?var1 ; wdt:employees ?var0 . FILTER(?var2 > 1000000) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:film . ?var0 wdt:director wd:Garry Marshall . ?var0 wdt:cast member wd:Julia Roberts . } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:film . ?var0 wdt:director wd:Garry Marshall . wd:Julia Roberts wdt:cast member ?var0 . } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:association football club . ?var0 wdt:league or competition wd:Premier League . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:association football club . wd:Premier League wdt:league or competition ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Ural Mountains wdt:highest point ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:highest point wd:Ural Mountains . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Wyoming wdt:head of government ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:head of government wd:Wyoming . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Eiffel Tower wdt:architect ?var1 . ?var1 wdt:educated at ?var0 }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:architect wd:Eiffel Tower . ?var1 wdt:educated at ?var0 }"
  },
  {
    "output":"PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:World Heritage Site ; wdt:time of discovery or invention ?var1 . BIND(xsd:integer(YEAR(?var1)) as ?var2) . BIND(xsd:integer(YEAR(NOW())) as ?var3) . FILTER(?var2 < ?var3 && ?var2 < (?var3 - 2)) . }",
    "input":"PREFIX xsd: <http:\/\/www.w3.org\/2001\/XMLSchema#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:instance of wd:World Heritage Site ; wdt:time of discovery or invention ?var0 . BIND(xsd:integer(YEAR(?var1)) as ?var2) . BIND(xsd:integer(YEAR(NOW())) as ?var3) . FILTER(?var2 < ?var3 && ?var2 < (?var3 - 2)) . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:actor ; wdt:place of birth wd:Paris ; wdt:date of birth ?var1 . BIND(YEAR(?var1) as ?var2) . FILTER(?var2 > 1950) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:occupation wd:actor ; wdt:place of birth wd:Paris ; wdt:date of birth ?var0 . BIND(YEAR(?var1) as ?var2) . FILTER(?var2 > 1950) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:cast member wd:Elizabeth Taylor . ?var0 wdt:cast member wd:Richard Burton . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:cast member wd:Elizabeth Taylor . wd:Richard Burton wdt:cast member ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:nonprofit organization . { ?var0 wdt:headquarters location|wdt:country wd:Australia . } UNION { ?var0 wdt:headquarters location|wdt:country ?var1 . ?var1 wdt:headquarters location wd:Australia } }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:nonprofit organization . { wd:Australia wdt:headquarters location|wdt:country ?var0 . } UNION { ?var0 wdt:headquarters location|wdt:country ?var1 . ?var1 wdt:headquarters location wd:Australia } }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:John Paul II <http:\/\/www.wikidata.org\/prop\/P39> ?var1 . ?var1 <http:\/\/www.wikidata.org\/prop\/statement\/P39> wd:pope . ?var1 <http:\/\/www.wikidata.org\/prop\/qualifier\/P1366> ?var0 } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:John Paul II <http:\/\/www.wikidata.org\/prop\/P39> ?var1 . ?var1 <http:\/\/www.wikidata.org\/prop\/statement\/P39> wd:pope . ?var0 <http:\/\/www.wikidata.org\/prop\/qualifier\/P1366> ?var1 } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:position held wd:President of Pakistan . ?var0 p:P39 ?var1 . ?var1 pq:P580 ?var2 ; pq:P582 ?var3 . FILTER(YEAR(?var2) <= 1978 && YEAR(?var3) >= 1978) . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> SELECT DISTINCT ?var0 WHERE { wd:President of Pakistan wdt:position held ?var0 . ?var0 p:P39 ?var1 . ?var1 pq:P580 ?var2 ; pq:P582 ?var3 . FILTER(YEAR(?var2) <= 1978 && YEAR(?var3) >= 1978) . }"
  }
]