[
  {
    "output":"PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:river . ?var0 p:P2043 ?var1. ?var1 psv:P2043 ?var2 . ?var2 wikibase:quantityAmount ?var3 . ?var2 wikibase:quantityUnit ?var4 . ?var2 wikibase:quantityLowerBound ?var5. ?var2 wikibase:quantityUpperBound ?var6. BIND((?var6-?var5)\/2 AS ?var8). BIND(IF(?var8=0, ?var3, (CONCAT(str(?var3), \"\", str(?var8)))) AS ?var32). ?var4 p:P2370 ?var4stmnode . ?var4stmnode psv:P2370 ?var4valuenode . ?var4valuenode wikibase:quantityAmount ?var13 . ?var4valuenode wikibase:quantityUnit wd:metre . BIND(?var3 * ?var13 AS ?var3_in_m) . } ORDER BY DESC(?var3_in_m) LIMIT 1",
    "input":"PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var0 WHERE { wd:river wdt:instance of ?var0 . ?var0 p:P2043 ?var1. ?var1 psv:P2043 ?var2 . ?var2 wikibase:quantityAmount ?var3 . ?var2 wikibase:quantityUnit ?var4 . ?var2 wikibase:quantityLowerBound ?var5. ?var2 wikibase:quantityUpperBound ?var6. BIND((?var6-?var5)\/2 AS ?var8). BIND(IF(?var8=0, ?var3, (CONCAT(str(?var3), \"\", str(?var8)))) AS ?var32). ?var4 p:P2370 ?var4stmnode . ?var4stmnode psv:P2370 ?var4valuenode . ?var4valuenode wikibase:quantityAmount ?var13 . ?var4valuenode wikibase:quantityUnit wd:metre . BIND(?var3 * ?var13 AS ?var3_in_m) . } ORDER BY DESC(?var3_in_m) LIMIT 1"
  },
  {
    "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT * WHERE { ?var0 wdt:inception ?var1 . ?var0 wdt:instance of\/wdt:located in the administrative territorial entity* wd:organization . FILTER(year(?var1) = 1930) . } ",
    "input":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT * WHERE { ?var0 wdt:inception ?var1 . wd:organization wdt:instance of\/wdt:located in the administrative territorial entity* ?var0 . FILTER(year(?var1) = 1930) . } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Angela Merkel wdt:birth name ?var0 . } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:birth name wd:Angela Merkel . } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Tom Cruise wdt:spouse ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:spouse wd:Tom Cruise . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:manufacturer wd:Heckler & Koch . ?var0 wdt:subclass of*\/wdt:instance of wd:weapon family . } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:manufacturer wd:Heckler & Koch . wd:weapon family wdt:subclass of*\/wdt:instance of ?var0 . } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:country wd:Germany . ?var0 wdt:instance of\/wdt:subclass of* wd:city . ?var0 wdt:population ?var1 . } ORDER BY ?var1 LIMIt 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:country wd:Germany . ?var0 wdt:instance of\/wdt:subclass of* wd:city . ?var1 wdt:population ?var0 . } ORDER BY ?var1 LIMIt 1"
  },
  {
    "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT ?var0 WHERE { ?var1 wdt:instance of wd:human . ?var1 p:P39 _:a ._:a ps:P39 wd:Mayor of Lisbon ._:a pq:P580 ?var2 . ?var1 wdt:member of political party ?var0 . } ORDER BY DESC(?var2) LIMIT 1",
    "input":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT ?var0 WHERE { ?var1 wdt:instance of wd:human . _:a p:P39 ?var1 ._:a ps:P39 wd:Mayor of Lisbon ._:a pq:P580 ?var2 . ?var1 wdt:member of political party ?var0 . } ORDER BY DESC(?var2) LIMIT 1"
  },
  {
    "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT * WHERE { ?var0 wdt:instance of wd:moon of Jupiter . ?var0 wdt:mass ?var1 . } ORDER BY ?var1 LIMIT 1",
    "input":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT * WHERE { wd:moon of Jupiter wdt:instance of ?var0 . ?var0 wdt:mass ?var1 . } ORDER BY ?var1 LIMIT 1"
  },
  {
    "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT ?var0 WHERE { wd:None wdt:employees ?var0 . } ",
    "input":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT ?var0 WHERE { ?var0 wdt:employees wd:None . } "
  },
  {
    "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT (COUNT(?var0) AS ?var1) WHERE { ?var0 wdt:season wd:The Sopranos, season 1 . }",
    "input":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT (COUNT(?var0) AS ?var1) WHERE { wd:The Sopranos, season 1 wdt:season ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Battlestar Galactica wdt:number of episodes ?var0 . wd:Battlestar Galactica wdt:number of episodes ?var1 . FILTER (?var0 > ?var1) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Battlestar Galactica wdt:number of episodes ?var0 . ?var1 wdt:number of episodes wd:Battlestar Galactica . FILTER (?var0 > ?var1) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:film . ?var0 wdt:producer wd:Hal Roach . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:film wdt:instance of ?var0 . ?var0 wdt:producer wd:Hal Roach . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT ?var0 WHERE { wd:The Matrix p:P161 _:a ._:a pq:P453 wd:Agent Smith ._:a ps:P161 ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT ?var0 WHERE { _:a p:P161 wd:The Matrix ._:a pq:P453 wd:Agent Smith ._:a ps:P161 ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:political party ; wdt:country wd:Greece ; wdt:political ideology wd:pro-Europeanism . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:political party wdt:instance of ?var0 ; wdt:country wd:Greece ; wdt:political ideology wd:pro-Europeanism . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:occupation wd:bandleader . ?var0 wdt:instrument wd:trumpet . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:occupation wd:bandleader . wd:trumpet wdt:instrument ?var0 . }"
  },
  {
    "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT ?var0 WHERE { ?var0 wdt:instance of\/wdt:subclass of* wd:mountain . ?var0 wdt:elevation above sea level ?var1 . ?var0 wdt:continent\/wdt:part of wd:Earth . } ORDER BY DESC(?var1) LIMIT 1 OFFSET 1",
    "input":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT ?var0 WHERE { ?var0 wdt:instance of\/wdt:subclass of* wd:mountain . ?var1 wdt:elevation above sea level ?var0 . ?var0 wdt:continent\/wdt:part of wd:Earth . } ORDER BY DESC(?var1) LIMIT 1 OFFSET 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { { SELECT ?var0 WHERE { ?var0 wdt:instance of wd:city . ?var0 wdt:country wd:Egypt . ?var0 wdt:population ?var1 . } ORDER BY DESC(?var1) LIMIT 1 } wd:Egypt wdt:capital ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { { SELECT wd:city WHERE { ?var0 wdt:instance of ?var0 . ?var0 wdt:country wd:Egypt . ?var0 wdt:population ?var1 . } ORDER BY DESC(?var1) LIMIT 1 } wd:Egypt wdt:capital ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:subclass of* wd:rocket . ?var0 wdt:start point wd:Baikonur Cosmodrome  . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:rocket wdt:subclass of* ?var0 . ?var0 wdt:start point wd:Baikonur Cosmodrome  . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { ?var0 wdt:instance of\/wdt:subclass of* wd:programming language . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) AS ?var1) WHERE { wd:programming language wdt:instance of\/wdt:subclass of* ?var0 . }"
  },
  {
    "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:place of birth _:a . ?var0 wdt:place of death _:a . ?var0 wdt:occupation\/wdt:subclass of* wd:chess player . }",
    "input":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT DISTINCT ?var0 WHERE { _:a wdt:place of birth ?var0 . ?var0 wdt:place of death _:a . ?var0 wdt:occupation\/wdt:subclass of* wd:chess player . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Meta wdt:owned by ?var0 . } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:owned by wd:Meta . } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Fort Knox wdt:located in the administrative territorial entity+ ?var0 . ?var0 wdt:instance of wd:U.S. state . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:located in the administrative territorial entity+ wd:Fort Knox . ?var0 wdt:instance of wd:U.S. state . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:city . ?var0 wdt:located in the administrative territorial entity+ wd:New Jersey . ?var0 wdt:population ?var1 . FILTER(?var1 > 100000) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:city . wd:New Jersey wdt:located in the administrative territorial entity+ ?var0 . ?var0 wdt:population ?var1 . FILTER(?var1 > 100000) }"
  },
  {
    "output":"PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:mountain . ?var0 p:P2044 ?var1. ?var1 psv:P2044 ?var2 . ?var2 wikibase:quantityAmount ?var3 . ?var2 wikibase:quantityUnit ?var4 . wd:Nanga Parbat wdt:elevation above sea level ?var3NangaParbat . FILTER(?var4 = wd:metre) FILTER (?var3 > ?var3NangaParbat) }",
    "input":"PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:mountain . ?var0 p:P2044 ?var1. ?var1 psv:P2044 ?var2 . ?var2 wikibase:quantityAmount ?var3 . ?var4 wikibase:quantityUnit ?var2 . wd:Nanga Parbat wdt:elevation above sea level ?var3NangaParbat . FILTER(?var4 = wd:metre) FILTER (?var3 > ?var3NangaParbat) }"
  },
  {
    "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT ?var0 WHERE { ?var0 wdt:performer wd:Ramones . ?var0 p:P1433 _:a ._:a pq:P2868 wd:B-side . }",
    "input":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT ?var0 WHERE { wd:Ramones wdt:performer ?var0 . ?var0 p:P1433 _:a ._:a pq:P2868 wd:B-side . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Olof Palme <http:\/\/www.wikidata.org\/prop\/P570> ?var0 }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 <http:\/\/www.wikidata.org\/prop\/P570> wd:Olof Palme }"
  },
  {
    "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT * WHERE { ?var0 wdt:position held wd:King of Rome . }",
    "input":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT * WHERE { wd:King of Rome wdt:position held ?var0 . }"
  },
  {
    "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT ?var0 WHERE {{ ?var0 wdt:place of birth\/wdt:located in the administrative territorial entity* wd:Vienna . { SELECT ?var0 WHERE { ?var0 wdt:place of death wd:Berlin . }}} UNION { ?var0 wdt:place of death\/wdt:located in the administrative territorial entity* wd:Berlin . { SELECT ?var0 WHERE { ?var0 wdt:place of birth wd:Vienna . }}} UNION { ?var0 wdt:place of birth\/wdt:located in the administrative territorial entity+ wd:Vienna . { SELECT ?var0 WHERE { ?var0 wdt:place of death\/wdt:located in the administrative territorial entity+ wd:Berlin . }}}}",
    "input":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> SELECT ?var0 WHERE {{ ?var0 wdt:place of birth\/wdt:located in the administrative territorial entity* wd:Vienna . { SELECT ?var0 WHERE { ?var0 wdt:place of death wd:Berlin . }}} UNION { ?var0 wdt:place of death\/wdt:located in the administrative territorial entity* wd:Berlin . { SELECT ?var0 WHERE { wd:Berlin wdt:place of birth wd:Vienna . }}} UNION { ?var0 wdt:place of birth\/wdt:located in the administrative territorial entity+ wd:Vienna . { SELECT ?var0 WHERE { ?var0 wdt:place of death\/wdt:located in the administrative territorial entity+ ?var0 . }}}}"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Darth Vader wdt:child wd:Luke Skywalker . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Luke Skywalker wdt:child wd:Darth Vader . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:brewery . ?var0 wdt:country wd:Australia . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:brewery wdt:instance of ?var0 . ?var0 wdt:country wd:Australia . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:producer wd:Steven Spielberg ; wdt:instance of\/wdt:subclass of* wd:film ; wdt:capital cost ?var1 . FILTER(?var1 > 80000000)}",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Steven Spielberg wdt:producer ?var0 ; wdt:instance of\/wdt:subclass of* wd:film ; wdt:capital cost ?var1 . FILTER(?var1 > 80000000)}"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:association football club . ?var0 wdt:country wd:Spain . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:association football club . wd:Spain wdt:country ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:instance of wd:film . ?var1 wdt:cast member wd:Natalie Portman . ?var1 wdt:producer ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:film wdt:instance of ?var1 . ?var1 wdt:cast member wd:Natalie Portman . ?var1 wdt:producer ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:subclass of* wd:German Shepherd FILTER(?var0 != wd:German Shepherd) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:German Shepherd wdt:subclass of* ?var0 FILTER(?var0 != wd:German Shepherd) }"
  },
  {
    "output":"PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var0 ?var1 WHERE { ?var0 wdt:member of sports team wd:Chicago Bulls ; p:P54 ?var2 . ?var2 a wikibase:BestRank; ?var3 wd:Chicago Bulls ; pq:P580 ?var4 . MINUS { ?var2 pq:P582 ?var5 . } MINUS { ?var0 wdt:work period (end) ?var6 . } ?var0 p:P2067 ?var7 . ?var7 psv:P2067 ?var8 . ?var8 wikibase:quantityAmount ?var9 . ?var8 wikibase:quantityUnit ?var10 . BIND(IF(?var10 = wd:kilogram, ?var9, ?var9*0.453592) AS ?var1) } ORDER BY DESC(?var1)",
    "input":"PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var0 ?var1 WHERE { ?var0 wdt:member of sports team wd:Chicago Bulls ; p:P54 ?var2 . ?var2 a wikibase:BestRank; ?var3 wd:Chicago Bulls ; pq:P580 ?var4 . MINUS { ?var2 pq:P582 ?var5 . } MINUS { ?var0 wdt:work period (end) ?var6 . } ?var0 p:P2067 ?var7 . ?var8 psv:P2067 ?var7 . ?var8 wikibase:quantityAmount ?var9 . ?var8 wikibase:quantityUnit ?var10 . BIND(IF(?var10 = wd:kilogram, ?var9, ?var9*0.453592) AS ?var1) } ORDER BY DESC(?var1)"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> prefix rdfs:   <http:\/\/www.w3.org\/2000\/01\/rdf-schema#>  SELECT DISTINCT * WHERE { ?var0 wdt:instance of wd:country . ?var0 wdt:area ?var1 . ?var0 rdfs:label ?var2 } ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> prefix rdfs:   <http:\/\/www.w3.org\/2000\/01\/rdf-schema#>  SELECT DISTINCT * WHERE { ?var0 wdt:instance of wd:country . ?var1 wdt:area ?var0 . ?var0 rdfs:label ?var2 } ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:country wd:United States . ?var0 wdt:instance of\/wdt:subclass of* wd:city . ?var0 wdt:population ?var1 . } ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:country wd:United States . wd:city wdt:instance of\/wdt:subclass of* ?var0 . ?var0 wdt:population ?var1 . } ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/>  SELECT ?var0 WHERE { wd:Vatican Media wdt:inception ?var1 . ?var0 wdt:position held wd:pope . ?var0 p:P39 _:a . _:a ps:P39 wd:pope . _:a pq:P580 ?var2 . _:a pq:P582 ?var3 . FILTER( ?var2 <= ?var1 && ?var1 <= ?var3) . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/>  SELECT ?var0 WHERE { wd:Vatican Media wdt:inception ?var1 . ?var0 wdt:position held wd:pope . ?var0 p:P39 _:a . wd:pope ps:P39 _:a . _:a pq:P580 ?var2 . _:a pq:P582 ?var3 . FILTER( ?var2 <= ?var1 && ?var1 <= ?var3) . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Ceres wdt:discoverer or inventor ?var0  . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:discoverer or inventor wd:Ceres  . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Netherlands wdt:head of state ?var0 . ?var0 wdt:position held wd:King of the Netherlands . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:head of state wd:Netherlands . ?var0 wdt:position held wd:King of the Netherlands . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:cola wdt:subclass of+ wd:drink . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:drink wdt:subclass of+ wd:cola . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Angela Merkel wdt:educated at ?var0 . ?var0 wdt:instance of\/wdt:subclass of* wd:university . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Angela Merkel wdt:educated at ?var0 . wd:university wdt:instance of\/wdt:subclass of* ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Yeti Airlines wdt:airline hub ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:airline hub wd:Yeti Airlines . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Johann Wolfgang von Goethe wdt:place of birth ?var0 . } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:place of birth wd:Johann Wolfgang von Goethe . } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Cuban Missile Crisis wdt:end time ?var0 . wd:Bay of Pigs invasion wdt:start time ?var1 . FILTER(?var0 < ?var1) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { ?var0 wdt:end time wd:Cuban Missile Crisis . wd:Bay of Pigs invasion wdt:start time ?var1 . FILTER(?var0 < ?var1) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:carrot cake wdt:has part(s) ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:has part(s) wd:carrot cake . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Wikipedia wdt:founded by ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:founded by wd:Wikipedia . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:instance of wd:mountain . ?var0 wdt:located in the administrative territorial entity+ wd:Saxony . ?var0 wdt:elevation above sea level ?var1 . } ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:mountain wdt:instance of ?var0 . ?var0 wdt:located in the administrative territorial entity+ wd:Saxony . ?var0 wdt:elevation above sea level ?var1 . } ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/>  SELECT ?var0 WHERE { ?var0 p:P39 _:a . _:a ps:P39 wd:Federal Minister of Finance . :a pq:P580 ?var1 . } ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/>  SELECT ?var0 WHERE { _:a p:P39 ?var0 . _:a ps:P39 wd:Federal Minister of Finance . :a pq:P580 ?var1 . } ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Mecca wdt:located in the administrative territorial entity+ ?var0 . ?var0 wdt:instance of wd:country . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Mecca wdt:located in the administrative territorial entity+ ?var0 . wd:country wdt:instance of ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Gus Fring ^<http:\/\/www.wikidata.org\/prop\/qualifier\/P453>\/<http:\/\/www.wikidata.org\/prop\/statement\/P161> ?var0 } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 ^<http:\/\/www.wikidata.org\/prop\/qualifier\/P453>\/<http:\/\/www.wikidata.org\/prop\/statement\/P161> wd:Gus Fring } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Nile wdt:origin of the watercourse\/wdt:country ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:origin of the watercourse\/wdt:country wd:Nile . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Pennsylvania State University wdt:located in the administrative territorial entity ?var0 . ?var0 wdt:instance of\/wdt:subclass of* wd:state . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:located in the administrative territorial entity wd:Pennsylvania State University . ?var0 wdt:instance of\/wdt:subclass of* wd:state . }"
  }
]