[
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Michael Jordan wdt:height ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:height wd:Michael Jordan . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Secret Intelligence Service wdt:headquarters location ?var0 . ?var0  wdt:instance of  wd:city . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Secret Intelligence Service wdt:headquarters location ?var0 . wd:city  wdt:instance of  ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Family Guy wdt:creator ?var0}",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:creator wd:Family Guy}"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 WHERE { wd:Elvis Presley  wdt:child  ?var1 . ?var1  wdt:child ?var0 }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 WHERE { ?var1  wdt:child  wd:Elvis Presley . ?var1  wdt:child ?var0 }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Ming dynasty wdt:dissolved, abolished or demolished date ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:dissolved, abolished or demolished date wd:Ming dynasty . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 WHERE { wd:T. E. Lawrence  wdt:participated in conflict  ?var0 .  } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 WHERE { ?var0  wdt:participated in conflict  wd:T. E. Lawrence .  } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 WHERE { wd:San Pedro de Atacama  wdt:located in time zone  ?var0 .  } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 WHERE { ?var0  wdt:located in time zone  wd:San Pedro de Atacama .  } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Bruce Carver  wdt:cause of death  ?var0 .  }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0  wdt:cause of death  wd:Bruce Carver .  }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Abraham Lincoln  wdt:place of death  ?var0 . ?var0  wdt:official website  ?var1 .  }  ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { ?var0  wdt:place of death  wd:Abraham Lincoln . ?var0  wdt:official website  ?var1 .  }  "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Elvis Presley wdt:child ?var0 }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { ?var0 wdt:child wd:Elvis Presley }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:None  wdt:spouse  wd:Michelle Obama . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Michelle Obama  wdt:spouse  wd:None . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Sylvester Stallone wdt:residence ?var0 . ?var0 wdt:instance of wd:city . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:residence wd:Sylvester Stallone . ?var0 wdt:instance of wd:city . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 WHERE { ?var0  wdt:publisher  wd:Viking Press . ?var0  wdt:instance of  wd:written work . ?var0  wdt:author  wd:Jack Kerouac . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 WHERE { ?var0  wdt:publisher  wd:Viking Press . wd:written work  wdt:instance of  ?var0 . ?var0  wdt:author  wd:Jack Kerouac . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Hotel California wdt:composer ?var0}",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:composer wd:Hotel California}"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Canada  wdt:capital  ?var0 .  }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0  wdt:capital  wd:Canada .  }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Tel Aviv wdt:head of government ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:head of government wd:Tel Aviv . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Russia <http:\/\/www.wikidata.org\/prop\/P122> ?var1 . ?var1 <http:\/\/www.wikidata.org\/prop\/statement\/P122> ?var0 . FILTER NOT EXISTS { ?var1 <http:\/\/www.wikidata.org\/prop\/qualifier\/P582> ?var2 }} ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Russia <http:\/\/www.wikidata.org\/prop\/P122> ?var1 . ?var1 <http:\/\/www.wikidata.org\/prop\/statement\/P122> ?var0 . FILTER NOT EXISTS { ?var2 <http:\/\/www.wikidata.org\/prop\/qualifier\/P582> ?var1 }} "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:book . ?var0 wdt:author wd:Muhammad Ali . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:book wdt:instance of ?var0 . ?var0 wdt:author wd:Muhammad Ali . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var1 ps:P793   wd:first ascent . ?var1 pq:P642 wd:Mount Everest . ?var0 p:P793 ?var1   . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:first ascent ps:P793   ?var1 . ?var1 pq:P642 wd:Mount Everest . ?var0 p:P793 ?var1   . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT (COUNT(?var0) as ?var1) WHERE { ?var0  ?var2  wd:Colombia . ?var0  wdt:instance of  wd:language .  }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT (COUNT(?var0) as ?var1) WHERE { ?var0  ?var2  wd:Colombia . wd:language  wdt:instance of  ?var0 .  }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Czech Republic wdt:currency ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:currency wd:Czech Republic . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Boris Becker <http:\/\/www.wikidata.org\/prop\/P106>\/<http:\/\/www.wikidata.org\/prop\/qualifier\/P582> ?var0 }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 <http:\/\/www.wikidata.org\/prop\/P106>\/<http:\/\/www.wikidata.org\/prop\/qualifier\/P582> wd:Boris Becker }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0  wdt:cast member  wd:Mickey Rourke .  ?var0  wdt:director  wd:Guy Ritchie . ?var0  wdt:instance of  wd:film . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0  wdt:cast member  wd:Mickey Rourke .  wd:Guy Ritchie  wdt:director  ?var0 . ?var0  wdt:instance of  wd:film . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:film . ?var0 wdt:cast member wd:Richard Gere . ?var0 wdt:cast member wd:Julia Roberts . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:film . wd:Richard Gere wdt:cast member ?var0 . ?var0 wdt:cast member wd:Julia Roberts . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:author wd:Ernest Hemingway . ?var0 wdt:genre wd:autobiography . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:author wd:Ernest Hemingway . wd:autobiography wdt:genre ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:instance of wd:borough of New York City . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:borough of New York City wdt:instance of ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT ?var0 WHERE { ?var0  wdt:genre  wd:grunge . ?var0  wdt:instance of  wd:record label . ?var0  wdt:country wd:Canada . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT ?var0 WHERE { ?var0  wdt:genre  wd:grunge . ?var0  wdt:instance of  wd:record label . wd:Canada  wdt:country ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT ?var0 WHERE { wd:Ganges  wdt:origin of the watercourse  ?var1 . ?var1  wdt:country  ?var0 .  } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT ?var0 WHERE { ?var1  wdt:origin of the watercourse  wd:Ganges . ?var1  wdt:country  ?var0 .  } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Penguin Books  wdt:founded by  ?var0 .  }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0  wdt:founded by  wd:Penguin Books .  }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Game of Thrones wdt:composer ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:composer wd:Game of Thrones . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Eritrea wdt:head of state ?var0}",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:head of state wd:Eritrea}"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:John F. Kennedy wdt:place of death\/wdt:located in the administrative territorial entity ?var0 . ?var0 wdt:instance of wd:city  .  } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:John F. Kennedy wdt:place of death\/wdt:located in the administrative territorial entity ?var0 . wd:city wdt:instance of ?var0  .  } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:mountain . ?var0 wdt:continent wd:Australian continent . ?var0 wdt:elevation above sea level ?var1. } ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:mountain . ?var0 wdt:continent wd:Australian continent . ?var1 wdt:elevation above sea level ?var0. } ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE {   wd:People's Republic of China  wdt:currency  ?var0 .  } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE {   ?var0  wdt:currency  wd:People's Republic of China .  } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE {   ?var0  wdt:country of citizenship  wd:Sweden .   ?var0  wdt:occupation  wd:oceanographer .  }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE {   wd:Sweden  wdt:country of citizenship  ?var0 .   ?var0  wdt:occupation  wd:oceanographer .  }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Headquarters of the United Nations wdt:located in the administrative territorial entity ?var0 . { ?var0 wdt:instance of wd:city . } UNION {?var0 wdt:instance of\/wdt:subclass of wd:city . } }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Headquarters of the United Nations wdt:located in the administrative territorial entity ?var0 . { ?var0 wdt:instance of wd:city . } UNION {wd:city wdt:instance of\/wdt:subclass of ?var0 . } }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Tom Hanks  wdt:spouse  wd:Rita Wilson . } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Rita Wilson  wdt:spouse  wd:Tom Hanks . } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:country . ?var0 wdt:official language wd:Japanese . } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:country wdt:instance of ?var0 . ?var0 wdt:official language wd:Japanese . } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 WHERE {    ?var0  ?var1  wd:Tim Burton . ?var0  wdt:instance of  wd:film .  ?var0  wdt:budget ?var2 } order by ?var2 limit 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT DISTINCT ?var0 WHERE {    wd:Tim Burton  ?var1  ?var0 . ?var0  wdt:instance of  wd:film .  ?var0  wdt:budget ?var2 } order by ?var2 limit 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT ?var0 WHERE { ?var0  wdt:headquarters location  wd:New York City . ?var0  wdt:instance of  wd:museum . ?var0  wdt:visitors per year ?var1 } order by ?var1 limit 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/>  SELECT ?var0 WHERE { ?var0  wdt:headquarters location  wd:New York City . wd:museum  wdt:instance of  ?var0 . ?var0  wdt:visitors per year ?var1 } order by ?var1 limit 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:album . ?var0 wdt:performer wd:Queen . ?var0 wdt:publication date ?var1 } ORDER BY ?var1 LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:album wdt:instance of ?var0 . ?var0 wdt:performer wd:Queen . ?var0 wdt:publication date ?var1 } ORDER BY ?var1 LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0  wdt:instance of  wd:film . ?var0  wdt:cast member  wd:Alec Guinness . ?var0 wdt:publication date ?var1 . }  order by DESC(?var1)  limit 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0  wdt:instance of  wd:film . ?var0  wdt:cast member  wd:Alec Guinness . ?var1 wdt:publication date ?var0 . }  order by DESC(?var1)  limit 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE {   wd:Last Action Hero  wdt:cast member  ?var0 .  } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE {   ?var0  wdt:cast member  wd:Last Action Hero .  } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE {   wd:Pluto  wdt:discoverer or inventor  ?var0 .   ?var0  wdt:instance of  wd:human .  } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE {   wd:Pluto  wdt:discoverer or inventor  ?var0 .   wd:human  wdt:instance of  ?var0 .  } "
  }
]