[
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { { ?var0 wdt:instance of wd:stadium .  } UNION { ?var0 wdt:instance of ?var1 . ?var1 wdt:subclass of wd:stadium } ?var0 wdt:country wd:Spain .  ?var0 wdt:maximum capacity ?var2 .  } ORDER BY DESC(?var2) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { { ?var0 wdt:instance of wd:stadium .  } UNION { ?var1 wdt:instance of ?var0 . ?var1 wdt:subclass of wd:stadium } ?var0 wdt:country wd:Spain .  ?var0 wdt:maximum capacity ?var2 .  } ORDER BY DESC(?var2) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:United Kingdom wdt:area ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:area wd:United Kingdom . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Batman wdt:creator ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:creator wd:Batman . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Sigmund Freud wdt:spouse ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { ?var0 wdt:spouse wd:Sigmund Freud . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:DBpedia wdt:founded by ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:founded by wd:DBpedia . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of\/wdt:subclass of* wd:film ; wdt:director wd:Francis Ford Coppola . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Francis Ford Coppola wdt:instance of\/wdt:subclass of* wd:film ; wdt:director ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Hylidae wdt:parent taxon* wd:Amphibia . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Amphibia wdt:parent taxon* wd:Hylidae . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Palace of Westminster wdt:located in the administrative territorial entity ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:located in the administrative territorial entity wd:Palace of Westminster . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Dsseldorf Airport wdt:elevation above sea level ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:elevation above sea level wd:Dsseldorf Airport . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Mexico City wdt:population ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:population wd:Mexico City . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:French Fifth Republic wdt:inception ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:inception wd:French Fifth Republic . }"
  },
  {
    "output":"PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:position held wd:monarch of England . ?var0 p:P39 ?var1 . ?var1 pq:P580 ?var2 . } ORDER BY ?var2 LIMIT 1",
    "input":"PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:position held wd:monarch of England . ?var1 p:P39 ?var0 . ?var1 pq:P580 ?var2 . } ORDER BY ?var2 LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Forbes wdt:editor ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:editor wd:Forbes . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Douglas Hofstadter wdt:award received ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:award received wd:Douglas Hofstadter . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:occupation wd:darts player ; wdt:date of birth ?var1 . } ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:occupation wd:darts player ; wdt:date of birth ?var0 . } ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:horse racing wdt:subclass of* wd:sport . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:sport wdt:subclass of* wd:horse racing . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Brooklyn Bridge wdt:crosses ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:crosses wd:Brooklyn Bridge . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Poland wdt:population ?var0 }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:population wd:Poland }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Friends wdt:end time ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:end time wd:Friends . }"
  },
  {
    "output":"PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:None wdt:spouse ?var0 . ?var0 rdfs:label ?var1 . FILTER regex(?var1, \"Michelle\") }",
    "input":"PREFIX rdfs: <http:\/\/www.w3.org\/2000\/01\/rdf-schema#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { ?var0 wdt:spouse wd:None . ?var0 rdfs:label ?var1 . FILTER regex(?var1, \"Michelle\") }"
  },
  {
    "output":"PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var0 WHERE { wd:United States p:P6 ?var1 . ?var1 pq:P580 ?var2 ; ps:P6 ?var0 . } ORDER BY ?var2 OFFSET 7 LIMIT 1",
    "input":"PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var0 WHERE { ?var1 p:P6 wd:United States . ?var1 pq:P580 ?var2 ; ps:P6 ?var0 . } ORDER BY ?var2 OFFSET 7 LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:European Union wdt:population ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:population wd:European Union . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:spaceport ; wdt:operator wd:National Aeronautics and Space Administration . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:National Aeronautics and Space Administration wdt:instance of wd:spaceport ; wdt:operator ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:World of Warcraft wdt:developer ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:developer wd:World of Warcraft . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Adele wdt:birth name ?var0. }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:birth name wd:Adele. }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Cairo wdt:population ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:population wd:Cairo . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Frank Herbert wdt:date of death ?var0 . FILTER(!BOUND(?var0)) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { ?var0 wdt:date of death wd:Frank Herbert . FILTER(!BOUND(?var0)) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:author wd:Dan Brown ; wdt:publication date ?var1 . } ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:author wd:Dan Brown ; wdt:publication date ?var0 . } ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { VALUES ?var1 { wdt:country wdt:location wdt:located in the administrative territorial entity } wd:Sungkyunkwan University ?var1 ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { VALUES ?var1 { wdt:country wdt:location wdt:located in the administrative territorial entity } ?var0 ?var1 wd:Sungkyunkwan University . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:The Interpretation of Dreams wdt:author ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:author wd:The Interpretation of Dreams . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:William Shakespeare wdt:date of death ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:date of death wd:William Shakespeare . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:product or material produced wd:Slack}",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Slack wdt:product or material produced ?var0}"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Rachel Stevens wdt:date of birth ?var1 . BIND(YEAR(?var1) as ?var0) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:date of birth wd:Rachel Stevens . BIND(YEAR(?var1) as ?var0) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) as ?var1) WHERE { wd:Jane Fonda wdt:spouse ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) as ?var1) WHERE { ?var0 wdt:spouse wd:Jane Fonda . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Abraham Lincoln wdt:spouse ?var0 .  ?var0 <http:\/\/www.w3.org\/2000\/01\/rdf-schema#label> ?var1 .  FILTER(regex(?var1,'Mary')) }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Abraham Lincoln wdt:spouse ?var0 .  ?var1 <http:\/\/www.w3.org\/2000\/01\/rdf-schema#label> ?var0 .  FILTER(regex(?var1,'Mary')) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:GIMP wdt:programmed in ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:programmed in wd:GIMP . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { VALUES ?var1 { wd:university wd:public university } wd:Angela Merkel wdt:educated at ?var0 . ?var0 wdt:instance of ?var1 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { VALUES ?var1 { wd:university wd:public university } ?var0 wdt:educated at wd:Angela Merkel . ?var0 wdt:instance of ?var1 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of\/wdt:subclass of* wd:dramatico-musical work ; wdt:composer wd:None . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:dramatico-musical work wdt:instance of\/wdt:subclass of* ?var0 ; wdt:composer wd:None . }"
  },
  {
    "output":"PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:river . ?var0 p:P2043 ?var1. ?var1 psv:P2043 ?var2 . ?var2 wikibase:quantityAmount ?var3 . ?var2 wikibase:quantityUnit ?var4 . ?var2 wikibase:quantityLowerBound ?var5. ?var2 wikibase:quantityUpperBound ?var6. BIND((?var6-?var5)\/2 AS ?var8). BIND(IF(?var8=0, ?var3, (CONCAT(str(?var3), \"\", str(?var8)))) AS ?var32). ?var4 p:P2370 ?var4stmnode . ?var4stmnode psv:P2370 ?var4valuenode . ?var4valuenode wikibase:quantityAmount ?var13 . ?var4valuenode wikibase:quantityUnit wd:metre . BIND(?var3 * ?var13 AS ?var3_in_m) . } ORDER BY DESC(?var3_in_m) LIMIT 1",
    "input":"PREFIX psv: <http:\/\/www.wikidata.org\/prop\/statement\/value\/> PREFIX wikibase: <http:\/\/wikiba.se\/ontology#> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:river . ?var0 p:P2043 ?var1. ?var1 psv:P2043 ?var2 . ?var2 wikibase:quantityAmount ?var3 . ?var2 wikibase:quantityUnit ?var4 . ?var2 wikibase:quantityLowerBound ?var5. ?var6 wikibase:quantityUpperBound ?var2. BIND((?var6-?var5)\/2 AS ?var8). BIND(IF(?var8=0, ?var3, (CONCAT(str(?var3), \"\", str(?var8)))) AS ?var32). ?var4 p:P2370 ?var4stmnode . ?var4stmnode psv:P2370 ?var4valuenode . ?var4valuenode wikibase:quantityAmount ?var13 . ?var4valuenode wikibase:quantityUnit wd:metre . BIND(?var3 * ?var13 AS ?var3_in_m) . } ORDER BY DESC(?var3_in_m) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:John Adams wdt:date of birth ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:date of birth wd:John Adams . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:instance of\/wdt:subclass of* wd:hovercraft ; wdt:manufacturer ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of\/wdt:subclass of* wd:hovercraft ; wdt:manufacturer ?var1 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Abraham Lincoln wdt:spouse ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:spouse wd:Abraham Lincoln . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:elephant wdt:subclass of ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:subclass of wd:elephant . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Australia wdt:capital ?var1 . ?var1 wdt:population ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:capital wd:Australia . ?var1 wdt:population ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:currency wd:cocoa bean . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:cocoa bean wdt:currency ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) as ?var1) WHERE { wd:Albert Einstein wdt:notable work ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT (COUNT(DISTINCT ?var0) as ?var1) WHERE { ?var0 wdt:notable work wd:Albert Einstein . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  wd:Titanic wdt:composer ?var0 }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE {  ?var0 wdt:composer wd:Titanic }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Toy Story wdt:duration ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:duration wd:Toy Story . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Iran wdt:shares border with ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { ?var0 wdt:shares border with wd:Iran . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0  wdt:industry wd:consumer electronics ;  wdt:location of formation wd:Beijing . } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Beijing  wdt:industry wd:consumer electronics ;  wdt:location of formation ?var0 . } "
  },
  {
    "output":"PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT ?var0 WHERE { wd:John F. Kennedy p:P39 ?var1 . ?var1 ps:P39 wd:President of the United States ; pq:P1366 ?var0 . }",
    "input":"PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> SELECT ?var0 WHERE { ?var1 p:P39 wd:John F. Kennedy . ?var1 ps:P39 wd:President of the United States ; pq:P1366 ?var0 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Paris wdt:head of government ?var0  . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:head of government wd:Paris  . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Arnold Schwarzenegger wdt:educated at ?var0 . ?var0 wdt:instance of\/wdt:subclass of* wd:university . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { ?var0 wdt:educated at wd:Arnold Schwarzenegger . ?var0 wdt:instance of\/wdt:subclass of* wd:university . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:James Bond wdt:spouse ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { ?var0 wdt:spouse wd:James Bond . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Isar wdt:mouth of the watercourse ?var0 . ?var0 wdt:instance of wd:lake  . } ",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { ?var0 wdt:mouth of the watercourse wd:Isar . ?var0 wdt:instance of wd:lake  . } "
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of wd:business  . ?var0 wdt:country wd:India . ?var0 wdt:employees ?var1 . } ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:business wdt:instance of ?var0  . ?var0 wdt:country wd:India . ?var0 wdt:employees ?var1 . } ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:John F. Kennedy p:P39 ?var1 . ?var1 ps:P39 wd:President of the United States ; pq:P580 ?var2 ; pq:P582 ?var3 . ?var0 p:P39 ?var4 . ?var4 ps:P39 wd:Vice President of the United States ; pq:P580 ?var5 ; pq:P582 ?var6 . FILTER(?var5 >= ?var2 && ?var5 <= ?var3) }",
    "input":"PREFIX ps: <http:\/\/www.wikidata.org\/prop\/statement\/> PREFIX p: <http:\/\/www.wikidata.org\/prop\/> PREFIX pq: <http:\/\/www.wikidata.org\/prop\/qualifier\/> PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:John F. Kennedy p:P39 ?var1 . ?var1 ps:P39 wd:President of the United States ; pq:P580 ?var2 ; pq:P582 ?var3 . ?var0 p:P39 ?var4 . ?var5 ps:P39 wd:Vice President of the United States ; pq:P580 ?var4 ; pq:P582 ?var6 . FILTER(?var5 >= ?var2 && ?var5 <= ?var3) }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Miffy wdt:creator ?var1 . ?var1 wdt:country of citizenship ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT ?var0 WHERE { wd:Miffy wdt:creator ?var1 . ?var0 wdt:country of citizenship ?var1 . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Heineken wdt:manufacturer\/wdt:headquarters location ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/> PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:manufacturer\/wdt:headquarters location wd:Heineken . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:None wdt:member of political party wd:Democratic Party . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> ASK WHERE { wd:Democratic Party wdt:member of political party wd:None . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:Margaret Thatcher wdt:child ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:child wd:Margaret Thatcher . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:North Rhine-Westphalia wdt:area ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:area wd:North Rhine-Westphalia . }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:instance of\/wdt:279* wd:city ; wdt:population ?var1 . } ORDER BY DESC(?var1) LIMIT 1",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:instance of\/wdt:279* wd:city ; wdt:population ?var0 . } ORDER BY DESC(?var1) LIMIT 1"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var0 wdt:chairperson wd:Donald Trump ; wdt:instance of\/wdt:subclass of* wd:business . MINUS { ?var0 wdt:dissolved, abolished or demolished date ?var1 } }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:business wdt:chairperson wd:Donald Trump ; wdt:instance of\/wdt:subclass of* ?var0 . MINUS { ?var0 wdt:dissolved, abolished or demolished date ?var1 } }"
  },
  {
    "output":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { wd:2018 FIFA World Cup wdt:final event ?var1 . ?var1 wdt:start time ?var0 . }",
    "input":"PREFIX wdt: <http:\/\/www.wikidata.org\/prop\/direct\/>  PREFIX wd: <http:\/\/www.wikidata.org\/entity\/> SELECT DISTINCT ?var0 WHERE { ?var1 wdt:final event wd:2018 FIFA World Cup . ?var1 wdt:start time ?var0 . }"
  }
]